{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/minchel93/Desktop/ECON-613/ECON-613 HW#5.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Apr 2019, 18:09:37
{txt}
{com}. 
. clear
{txt}
{com}. 
. ******
. *HW 2*
. ******
. 
. ** Exercise 1
. 
. set seed 1
{txt}
{com}. set obs 10000 
{txt}{p}
number of observations (_N)  was 0,
now 10,000
{p_end}

{com}. gen X1 = runiform(1, 3) 
{txt}
{com}. gen X2 = rgamma(3, 2)
{txt}
{com}. gen X3 = rbinomial(1, 0.3)
{txt}
{com}. gen eps = rnormal(2, 1)
{txt}
{com}. 
. gen Y = 0.5 + 1.2 * X1 - 0.9 * X2 + 0.1 * X3 + eps
{txt}
{com}. egen Y_mean = mean(Y)
{txt}
{com}. gen ydum = (Y > Y_mean)
{txt}
{com}. 
. ** Exercise 2
. 
. *2.1
. corr Y X1
{txt}(obs=10,000)

             {c |}        Y       X1
{hline 13}{c +}{hline 18}
           Y {c |}{res}   1.0000
          {txt}X1 {c |}{res}   0.2036   1.0000

{txt}
{com}. *** Correlation is 0.2036. This quantity is different from 1.2.
. 
. *2.2
. *** Regressing Y on X, Storing the Coefficients, and Making a Table
. reg Y X1 X2 X3

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    10,000
{txt}{hline 13}{c +}{hline 34}   F(3, 9996)      = {res} 34531.37
{txt}       Model {c |} {res} 105509.925         3  35169.9751   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 10180.8616     9,996  1.01849355   {txt}R-squared       ={res}    0.9120
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9120
{txt}       Total {c |} {res} 115690.787     9,999  11.5702357   {txt}Root MSE        =   {res} 1.0092

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.199747{col 26}{space 2} .0176288{col 37}{space 1}   68.06{col 46}{space 3}0.000{col 54}{space 4} 1.165191{col 67}{space 3} 1.234302
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.9010874{col 26}{space 2} .0028667{col 37}{space 1} -314.33{col 46}{space 3}0.000{col 54}{space 4}-.9067067{col 67}{space 3}-.8954681
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .1104427{col 26}{space 2} .0218767{col 37}{space 1}    5.05{col 46}{space 3}0.000{col 54}{space 4} .0675599{col 67}{space 3} .1533255
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.502585{col 26}{space 2} .0412646{col 37}{space 1}   60.65{col 46}{space 3}0.000{col 54}{space 4} 2.421698{col 67}{space 3} 2.583472
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto linear_coef
{txt}
{com}. est tab linear_coef
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:linear_c~f} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:1.1997465}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.90108742}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.11044271}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.5025849}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. *2.3
. *** Bootstrapping 49 and 499 Times
. bootstrap, rep(49): reg Y X1 X2 X3
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}49{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}Replications{col 67}= {res}        49
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res} 107904.73
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9120
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9120
{txt}{col 49}Root MSE{col 67}= {res}    1.0092

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.199747{col 26}{space 2} .0177973{col 37}{space 1}   67.41{col 46}{space 3}0.000{col 54}{space 4} 1.164864{col 67}{space 3} 1.234629
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.9010874{col 26}{space 2} .0028627{col 37}{space 1} -314.77{col 46}{space 3}0.000{col 54}{space 4}-.9066983{col 67}{space 3}-.8954766
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .1104427{col 26}{space 2} .0211778{col 37}{space 1}    5.22{col 46}{space 3}0.000{col 54}{space 4} .0689351{col 67}{space 3} .1519504
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.502585{col 26}{space 2} .0430144{col 37}{space 1}   58.18{col 46}{space 3}0.000{col 54}{space 4} 2.418278{col 67}{space 3} 2.586892
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto bootstrap_49
{txt}
{com}. est tab bootstrap_49
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:bootstr~49} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:1.1997465}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.90108742}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.11044271}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.5025849}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. bootstrap, rep(499): reg Y X1 X2 X3
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}499{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}Replications{col 67}= {res}       499
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}  97806.23
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9120
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9120
{txt}{col 49}Root MSE{col 67}= {res}    1.0092

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.199747{col 26}{space 2} .0177421{col 37}{space 1}   67.62{col 46}{space 3}0.000{col 54}{space 4} 1.164973{col 67}{space 3}  1.23452
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.9010874{col 26}{space 2} .0029597{col 37}{space 1} -304.45{col 46}{space 3}0.000{col 54}{space 4}-.9068884{col 67}{space 3}-.8952865
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .1104427{col 26}{space 2} .0232295{col 37}{space 1}    4.75{col 46}{space 3}0.000{col 54}{space 4} .0649138{col 67}{space 3} .1559716
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.502585{col 26}{space 2} .0424858{col 37}{space 1}   58.90{col 46}{space 3}0.000{col 54}{space 4} 2.419314{col 67}{space 3} 2.585856
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto bootstrap_499
{txt}
{com}. est tab bootstrap_499
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:bootst~499} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:1.1997465}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.90108742}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.11044271}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.5025849}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. *3
. *** Implementing Probit Model
. global xvars "X1 X2 X3"
{txt}
{com}. 
. probit ydum $xvars

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6838.7046}  
Iteration 1:{space 3}log likelihood = {res:-2237.2623}  
Iteration 2:{space 3}log likelihood = {res:-2146.4475}  
Iteration 3:{space 3}log likelihood = {res:-2145.4709}  
Iteration 4:{space 3}log likelihood = {res:-2145.4699}  
Iteration 5:{space 3}log likelihood = {res:-2145.4699}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}   9386.47
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2145.4699{txt}{col 49}Pseudo R2{col 67}= {res}    0.6863

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.208304{col 26}{space 2} .0439778{col 37}{space 1}   27.48{col 46}{space 3}0.000{col 54}{space 4} 1.122109{col 67}{space 3} 1.294499
{txt}{space 10}X2 {c |}{col 14}{res}{space 2} -.882597{col 26}{space 2} .0181383{col 37}{space 1}  -48.66{col 46}{space 3}0.000{col 54}{space 4}-.9181475{col 67}{space 3}-.8470465
{txt}{space 10}X3 {c |}{col 14}{res}{space 2}  .159586{col 26}{space 2} .0476496{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .0661944{col 67}{space 3} .2529775
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.887162{col 26}{space 2} .0987971{col 37}{space 1}   29.22{col 46}{space 3}0.000{col 54}{space 4} 2.693523{col 67}{space 3}   3.0808
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 485 failures and 7 successes completely determined.{p_end}

{com}. est sto Probit_model
{txt}
{com}. est tab Probit_model
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Probit_m~l} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:1.2083039}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.88259698}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.15958595}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.8871615}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. *4
. *** Implmenting Probit, Logit, and Linear Models
. 
. probit ydum $xvars

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6838.7046}  
Iteration 1:{space 3}log likelihood = {res:-2237.2623}  
Iteration 2:{space 3}log likelihood = {res:-2146.4475}  
Iteration 3:{space 3}log likelihood = {res:-2145.4709}  
Iteration 4:{space 3}log likelihood = {res:-2145.4699}  
Iteration 5:{space 3}log likelihood = {res:-2145.4699}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}   9386.47
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2145.4699{txt}{col 49}Pseudo R2{col 67}= {res}    0.6863

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.208304{col 26}{space 2} .0439778{col 37}{space 1}   27.48{col 46}{space 3}0.000{col 54}{space 4} 1.122109{col 67}{space 3} 1.294499
{txt}{space 10}X2 {c |}{col 14}{res}{space 2} -.882597{col 26}{space 2} .0181383{col 37}{space 1}  -48.66{col 46}{space 3}0.000{col 54}{space 4}-.9181475{col 67}{space 3}-.8470465
{txt}{space 10}X3 {c |}{col 14}{res}{space 2}  .159586{col 26}{space 2} .0476496{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .0661944{col 67}{space 3} .2529775
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.887162{col 26}{space 2} .0987971{col 37}{space 1}   29.22{col 46}{space 3}0.000{col 54}{space 4} 2.693523{col 67}{space 3}   3.0808
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 485 failures and 7 successes completely determined.{p_end}

{com}. est sto Probit_model2
{txt}
{com}. est tab Probit_model2
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Probit_m~2} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:1.2083039}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.88259698}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.15958595}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.8871615}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. logit ydum $xvars

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6838.7046}  
Iteration 1:{space 3}log likelihood = {res:-2221.7563}  
Iteration 2:{space 3}log likelihood = {res:-2169.5106}  
Iteration 3:{space 3}log likelihood = {res:-2148.5957}  
Iteration 4:{space 3}log likelihood = {res:-2148.5045}  
Iteration 5:{space 3}log likelihood = {res:-2148.5045}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}   9380.40
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2148.5045{txt}{col 49}Pseudo R2{col 67}= {res}    0.6858

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 2.185584{col 26}{space 2} .0825068{col 37}{space 1}   26.49{col 46}{space 3}0.000{col 54}{space 4} 2.023874{col 67}{space 3} 2.347295
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-1.593766{col 26}{space 2} .0364984{col 37}{space 1}  -43.67{col 46}{space 3}0.000{col 54}{space 4}-1.665302{col 67}{space 3}-1.522231
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .2781579{col 26}{space 2} .0857319{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} .1101264{col 67}{space 3} .4461894
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.206374{col 26}{space 2} .1859287{col 37}{space 1}   28.00{col 46}{space 3}0.000{col 54}{space 4} 4.841961{col 67}{space 3} 5.570788
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 87 failures and 0 successes completely determined.{p_end}

{com}. est sto Logit_model
{txt}
{com}. est tab Logit_model
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Logit_mo~l} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:2.1855843}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-1.5937661}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.2781579}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:5.2063742}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. reg ydum $xvars

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    10,000
{txt}{hline 13}{c +}{hline 34}   F(3, 9996)      = {res}  4213.56
{txt}       Model {c |} {res} 1370.21827         3  456.739423   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1083.54173     9,996  .108397532   {txt}R-squared       ={res}    0.5584
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5583
{txt}       Total {c |} {res}    2453.76     9,999   .24540054   {txt}Root MSE        =   {res} .32924

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .1464242{col 26}{space 2} .0057511{col 37}{space 1}   25.46{col 46}{space 3}0.000{col 54}{space 4} .1351508{col 67}{space 3} .1576975
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1022686{col 26}{space 2} .0009352{col 37}{space 1} -109.35{col 46}{space 3}0.000{col 54}{space 4}-.1041018{col 67}{space 3}-.1004354
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0259566{col 26}{space 2}  .007137{col 37}{space 1}    3.64{col 46}{space 3}0.000{col 54}{space 4} .0119667{col 67}{space 3} .0399465
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8810542{col 26}{space 2} .0134619{col 37}{space 1}   65.45{col 46}{space 3}0.000{col 54}{space 4} .8546661{col 67}{space 3} .9074424
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto Linear_model
{txt}
{com}. est tab Linear_model
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Linear_m~l} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:.14642416}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.10226858}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.02595657}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.88105424}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. *5
. *** Computing the Marginal Effect of X on Y (Probit)
. probit ydum $xvars

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6838.7046}  
Iteration 1:{space 3}log likelihood = {res:-2237.2623}  
Iteration 2:{space 3}log likelihood = {res:-2146.4475}  
Iteration 3:{space 3}log likelihood = {res:-2145.4709}  
Iteration 4:{space 3}log likelihood = {res:-2145.4699}  
Iteration 5:{space 3}log likelihood = {res:-2145.4699}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}   9386.47
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2145.4699{txt}{col 49}Pseudo R2{col 67}= {res}    0.6863

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.208304{col 26}{space 2} .0439778{col 37}{space 1}   27.48{col 46}{space 3}0.000{col 54}{space 4} 1.122109{col 67}{space 3} 1.294499
{txt}{space 10}X2 {c |}{col 14}{res}{space 2} -.882597{col 26}{space 2} .0181383{col 37}{space 1}  -48.66{col 46}{space 3}0.000{col 54}{space 4}-.9181475{col 67}{space 3}-.8470465
{txt}{space 10}X3 {c |}{col 14}{res}{space 2}  .159586{col 26}{space 2} .0476496{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .0661944{col 67}{space 3} .2529775
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.887162{col 26}{space 2} .0987971{col 37}{space 1}   29.22{col 46}{space 3}0.000{col 54}{space 4} 2.693523{col 67}{space 3}   3.0808
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 485 failures and 7 successes completely determined.{p_end}

{com}. margins, dydx(*)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    10,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(ydum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2}  .144157{col 26}{space 2} .0043782{col 37}{space 1}   32.93{col 46}{space 3}0.000{col 54}{space 4} .1355759{col 67}{space 3} .1527381
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1052984{col 26}{space 2} .0004374{col 37}{space 1} -240.76{col 46}{space 3}0.000{col 54}{space 4}-.1061557{col 67}{space 3}-.1044412
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0190394{col 26}{space 2} .0056708{col 37}{space 1}    3.36{col 46}{space 3}0.001{col 54}{space 4} .0079249{col 67}{space 3}  .030154
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto Marginal_Probit
{txt}
{com}. est tab Marginal_Probit
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Marginal~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:1.2083039}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.88259698}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.15958595}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.8871615}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. margins, dydx(*) vce(delta)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    10,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(ydum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2}  .144157{col 26}{space 2} .0043782{col 37}{space 1}   32.93{col 46}{space 3}0.000{col 54}{space 4} .1355759{col 67}{space 3} .1527381
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1052984{col 26}{space 2} .0004374{col 37}{space 1} -240.76{col 46}{space 3}0.000{col 54}{space 4}-.1061557{col 67}{space 3}-.1044412
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0190394{col 26}{space 2} .0056708{col 37}{space 1}    3.36{col 46}{space 3}0.001{col 54}{space 4} .0079249{col 67}{space 3}  .030154
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto Marginal_Delta_Probit
{txt}
{com}. est tab Marginal_Delta_Probit
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Marginal~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:1.2083039}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.88259698}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.15958595}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.8871615}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. ** Bootstrap standard deviation calc under Margins is not specified in help func
. 
. logit ydum $xvars

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6838.7046}  
Iteration 1:{space 3}log likelihood = {res:-2221.7563}  
Iteration 2:{space 3}log likelihood = {res:-2169.5106}  
Iteration 3:{space 3}log likelihood = {res:-2148.5957}  
Iteration 4:{space 3}log likelihood = {res:-2148.5045}  
Iteration 5:{space 3}log likelihood = {res:-2148.5045}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}   9380.40
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2148.5045{txt}{col 49}Pseudo R2{col 67}= {res}    0.6858

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 2.185584{col 26}{space 2} .0825068{col 37}{space 1}   26.49{col 46}{space 3}0.000{col 54}{space 4} 2.023874{col 67}{space 3} 2.347295
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-1.593766{col 26}{space 2} .0364984{col 37}{space 1}  -43.67{col 46}{space 3}0.000{col 54}{space 4}-1.665302{col 67}{space 3}-1.522231
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .2781579{col 26}{space 2} .0857319{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} .1101264{col 67}{space 3} .4461894
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.206374{col 26}{space 2} .1859287{col 37}{space 1}   28.00{col 46}{space 3}0.000{col 54}{space 4} 4.841961{col 67}{space 3} 5.570788
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 87 failures and 0 successes completely determined.{p_end}

{com}. margins, dydx(*)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    10,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(ydum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2}  .144517{col 26}{space 2} .0043955{col 37}{space 1}   32.88{col 46}{space 3}0.000{col 54}{space 4} .1359019{col 67}{space 3}  .153132
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1053843{col 26}{space 2} .0004537{col 37}{space 1} -232.26{col 46}{space 3}0.000{col 54}{space 4}-.1062736{col 67}{space 3} -.104495
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0183926{col 26}{space 2} .0056539{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0073111{col 67}{space 3} .0294741
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto Marginal_Logit
{txt}
{com}. est tab Marginal_Logit
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Marginal~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:2.1855843}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-1.5937661}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.2781579}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:5.2063742}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. margins, dydx(*) vce(delta)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    10,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(ydum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2}  .144517{col 26}{space 2} .0043955{col 37}{space 1}   32.88{col 46}{space 3}0.000{col 54}{space 4} .1359019{col 67}{space 3}  .153132
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1053843{col 26}{space 2} .0004537{col 37}{space 1} -232.26{col 46}{space 3}0.000{col 54}{space 4}-.1062736{col 67}{space 3} -.104495
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0183926{col 26}{space 2} .0056539{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0073111{col 67}{space 3} .0294741
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto Marginal_Delta_Logit
{txt}
{com}. est tab Marginal_Delta_Logit
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Marginal~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:2.1855843}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-1.5937661}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.2781579}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:5.2063742}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. ** Bootstrap standard deviation calc under Margins is not specified in help func
. 
. ******
. *HW 3*
. ******
. * Importing Demos.csv
. insheet using "/Users/minchel93/Desktop/ECON-613/Demos.csv", clear
{txt}(9 vars, 516 obs)

{com}. sort hhid
{txt}
{com}. save Demos, replace
{txt}file Demos.dta saved

{com}. 
. * Importing ChoicePrice.csv
. insheet using"/Users/minchel93/Desktop/ECON-613/ChoicePrice.csv", clear
{txt}(13 vars, 4,470 obs)

{com}. sort hhid
{txt}
{com}. save ChoicePrice, replace
{txt}file ChoicePrice.dta saved

{com}. 
. * Merging Two Datasets
. merge hhid using Demos ChoicePrice
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} hhid
does not uniquely identify observations in
the master data
{p_end}
{p 0 4 2}
variable{txt} hhid
does not uniquely identify observations in
ChoicePrice.dta
{p_end}

{com}. save MergedData, replace
{txt}file MergedData.dta saved

{com}. 
. * Exercise 1
. * Average and dispersion in product characteristics
. su ppk_stk  pbb_stk pfl_stk phse_stk pgen_stk pimp_stk /*
> */ pss_tub ppk_tub pfl_tub phse_tub

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}ppk_stk {c |}{res}      4,470    .5184362    .1505174        .19        .67
{txt}{space 5}pbb_stk {c |}{res}      4,470    .5432103    .1203319        .19       1.01
{txt}{space 5}pfl_stk {c |}{res}      4,470     1.01502    .0428952        .95       1.16
{txt}{space 4}phse_stk {c |}{res}      4,470    .4371476    .1188312        .19        .64
{txt}{space 4}pgen_stk {c |}{res}      4,470    .3452819    .0351661        .25        .55
{txt}{hline 13}{c +}{hline 57}
{space 4}pimp_stk {c |}{res}      4,470    .7807785    .1146461        .33        2.3
{txt}{space 5}pss_tub {c |}{res}      4,470    .8250895    .0612116         .5        .98
{txt}{space 5}ppk_tub {c |}{res}      4,470    1.077409    .0297261        .98       1.24
{txt}{space 5}pfl_tub {c |}{res}      4,470    1.189376    .0140545        .69       1.47
{txt}{space 4}phse_tub {c |}{res}      4,470    .5686734     .072455        .33       1.27
{txt}
{com}. 
. * Market Share by Choice
. tab choice

     {txt}choice {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,766       39.51       39.51
{txt}          2 {c |}{res}        699       15.64       55.15
{txt}          3 {c |}{res}        243        5.44       60.58
{txt}          4 {c |}{res}        593       13.27       73.85
{txt}          5 {c |}{res}        315        7.05       80.89
{txt}          6 {c |}{res}         74        1.66       82.55
{txt}          7 {c |}{res}        319        7.14       89.69
{txt}          8 {c |}{res}        203        4.54       94.23
{txt}          9 {c |}{res}        225        5.03       99.26
{txt}         10 {c |}{res}         33        0.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. * Market Share by Tub vs. Stk
. gen market_char = cond(choice == 7 | choice == 8 | choice == 9 | /*
> */ choice == 10, "tub", "stk")
{txt}
{com}. tab market_char

{txt}market_char {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        stk {c |}{res}      3,690       82.55       82.55
{txt}        tub {c |}{res}        780       17.45      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. * Market Share by Brand
. gen market_brand = "ppk" if choice == 1 | choice == 8 
{txt}(2,501 missing values generated)

{com}. replace market_brand = "pbb" if choice == 2
{txt}(699 real changes made)

{com}. replace market_brand = "pfl" if choice == 3 | choice == 9
{txt}(468 real changes made)

{com}. replace market_brand = "phse" if choice == 4 | choice == 10
{txt}variable {bf}market_brand{sf} was {bf}{res}str3{sf}{txt} now {bf}{res}str4{sf}
{txt}(626 real changes made)

{com}. replace market_brand = "pgen" if choice == 5
{txt}(315 real changes made)

{com}. replace market_brand = "pimp" if choice == 6
{txt}(74 real changes made)

{com}. replace market_brand = "pss" if choice == 7
{txt}(319 real changes made)

{com}. tab market_brand

{txt}market_bran {c |}
          d {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        pbb {c |}{res}        699       15.64       15.64
{txt}        pfl {c |}{res}        468       10.47       26.11
{txt}       pgen {c |}{res}        315        7.05       33.15
{txt}       phse {c |}{res}        626       14.00       47.16
{txt}       pimp {c |}{res}         74        1.66       48.81
{txt}        ppk {c |}{res}      1,969       44.05       92.86
{txt}        pss {c |}{res}        319        7.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. * Exercise 2
. * Conditional Logit
. 
. * Renaming Colum Names
. rename (ppk_stk  pbb_stk pfl_stk phse_stk pgen_stk pimp_stk pss_tub /*
> */ppk_tub pfl_tub phse_tub) (Price1 Price2 Price3 Price4 Price5 Price6 Price7 /*
> */Price8 Price9 Price10)
{res}{txt}
{com}. 
. * Reshaping Wide-Format Price to Long-Format Price
. reshape long Price, i(v1)
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    4470   {txt}->{res}   44700
{txt}Number of variables            {res}      25   {txt}->{res}      17
{txt}j variable (10 values)                    ->   {res}_j
{txt}xij variables:
              {res}Price1 Price2 ... Price10   {txt}->   {res}Price
{txt}{hline 77}

{com}. 
. * Renaming First Two Columns
. rename (v1 _j) (Individual Brand)
{res}{txt}
{com}. 
. * Generating Dummy Variable
. gen dummy = (Brand == choice)
{txt}
{com}. 
. * Implementing Conditional Logit
. asclogit dummy Price, case(Individual) alternatives(Brand)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7559.2014}  
Iteration 1:{space 3}log likelihood = {res:-7465.2594}  
Iteration 2:{space 3}log likelihood = {res:-7464.9321}  
Iteration 3:{space 3}log likelihood = {res:-7464.9321}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: Individual{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: Brand{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}1{txt}){col 67}= {res}   1458.85
{txt}Log likelihood = {res}-7464.9321{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       dummy{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Brand        {txt}{c |}
{space 7}Price {c |}{col 14}{res}{space 2}-6.656579{col 26}{space 2} .1742793{col 37}{space 1}  -38.19{col 46}{space 3}0.000{col 54}{space 4} -6.99816{col 67}{space 3}-6.314998
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.9543068{col 26}{space 2} .0500462{col 37}{space 1}  -19.07{col 46}{space 3}0.000{col 54}{space 4}-1.052396{col 67}{space 3} -.856218
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.296968{col 26}{space 2} .1086515{col 37}{space 1}   11.94{col 46}{space 3}0.000{col 54}{space 4} 1.084015{col 67}{space 3} 1.509921
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.717332{col 26}{space 2} .0541582{col 37}{space 1}  -31.71{col 46}{space 3}0.000{col 54}{space 4} -1.82348{col 67}{space 3}-1.611184
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.904005{col 26}{space 2} .0714605{col 37}{space 1}  -40.64{col 46}{space 3}0.000{col 54}{space 4}-3.044065{col 67}{space 3}-2.763945
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.515311{col 26}{space 2} .1262303{col 37}{space 1}  -12.00{col 46}{space 3}0.000{col 54}{space 4}-1.762718{col 67}{space 3}-1.267904
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2517684{col 26}{space 2}  .079164{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0966098{col 67}{space 3}  .406927
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.464868{col 26}{space 2} .1180467{col 37}{space 1}   12.41{col 46}{space 3}0.000{col 54}{space 4} 1.233501{col 67}{space 3} 1.696236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.357505{col 26}{space 2}  .133774{col 37}{space 1}   17.62{col 46}{space 3}0.000{col 54}{space 4} 2.095313{col 67}{space 3} 2.619697
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-3.896594{col 26}{space 2}  .177419{col 37}{space 1}  -21.96{col 46}{space 3}0.000{col 54}{space 4}-4.244328{col 67}{space 3}-3.548859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto conditional_logit
{txt}
{com}. est tab conditional_logit
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:conditio~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}Brand        {txt}{c |}{res}
{txt}{space 7}Price {c |}{res} {ralign 10:-6.6565793}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}2            {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:-.95430683}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}3            {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:1.2969683}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}4            {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:-1.7173324}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}5            {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:-2.9040048}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}6            {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:-1.5153112}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}7            {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:.25176838}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}8            {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:1.4648684}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}9            {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:2.3575051}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}10           {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:-3.8965935}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. * Exercise 3
. * Multinomial Logit
. 
. * Implementing Multinomial Logit
. asclogit dummy, case(Individual) alternatives(Brand) casevar(income)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-8328.1129}  
Iteration 1:{space 3}log likelihood = {res:-8236.9407}  
Iteration 2:{space 3}log likelihood = {res: -8236.757}  
Iteration 3:{space 3}log likelihood = {res: -8236.757}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: Individual{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: Brand{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}    101.55
{txt}Log likelihood = {res} -8236.757{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       dummy{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0030887{col 26}{space 2}  .003114{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4} -.009192{col 67}{space 3} .0030145
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8453241{col 26}{space 2} .0931354{col 37}{space 1}   -9.08{col 46}{space 3}0.000{col 54}{space 4}-1.027866{col 67}{space 3} -.662782
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0145862{col 26}{space 2} .0038255{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0070885{col 67}{space 3}  .022084
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.399858{col 26}{space 2} .1335802{col 37}{space 1}  -17.97{col 46}{space 3}0.000{col 54}{space 4} -2.66167{col 67}{space 3}-2.138045
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040504{col 26}{space 2} .0030926{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-.0020109{col 67}{space 3} .0101118
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.201326{col 26}{space 2} .0971021{col 37}{space 1}  -12.37{col 46}{space 3}0.000{col 54}{space 4}-1.391643{col 67}{space 3} -1.01101
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0012536{col 26}{space 2} .0042024{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-.0094901{col 67}{space 3} .0069829
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.690582{col 26}{space 2} .1269952{col 37}{space 1}  -13.31{col 46}{space 3}0.000{col 54}{space 4}-1.939488{col 67}{space 3}-1.441676
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .030612{col 26}{space 2}  .004674{col 37}{space 1}    6.55{col 46}{space 3}0.000{col 54}{space 4} .0214512{col 67}{space 3} .0397729
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.139767{col 26}{space 2}  .210989{col 37}{space 1}  -19.62{col 46}{space 3}0.000{col 54}{space 4}-4.553298{col 67}{space 3}-3.726236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0069326{col 26}{space 2} .0044161{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4} -.015588{col 67}{space 3} .0017228
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.531042{col 26}{space 2} .1280434{col 37}{space 1}  -11.96{col 46}{space 3}0.000{col 54}{space 4}-1.782002{col 67}{space 3}-1.280081
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0228862{col 26}{space 2} .0036217{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} .0157878{col 67}{space 3} .0299845
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.848352{col 26}{space 2} .1393848{col 37}{space 1}  -20.44{col 46}{space 3}0.000{col 54}{space 4}-3.121541{col 67}{space 3}-2.575163
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .017743{col 26}{space 2} .0037623{col 37}{space 1}    4.72{col 46}{space 3}0.000{col 54}{space 4}  .010369{col 67}{space 3} .0251169
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.575597{col 26}{space 2}   .13614{col 37}{space 1}  -18.92{col 46}{space 3}0.000{col 54}{space 4}-2.842427{col 67}{space 3}-2.308768
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0107909{col 26}{space 2}   .01013{col 37}{space 1}    1.07{col 46}{space 3}0.287{col 54}{space 4}-.0090636{col 67}{space 3} .0306454
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.28227{col 26}{space 2}  .345792{col 37}{space 1}  -12.38{col 46}{space 3}0.000{col 54}{space 4} -4.96001{col 67}{space 3} -3.60453
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto multinomial_logit
{txt}
{com}. est tab multinomial_logit
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:multinom~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}2            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:-.00308874}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-.84532415}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}3            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.01458623}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-2.3998576}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}4            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.00405043}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.2013265}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}5            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:-.00125359}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.6905817}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}6            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.03061202}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-4.1397672}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}7            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:-.00693258}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.5310415}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}8            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.02288616}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-2.8483523}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}9            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.01774297}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-2.5755973}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}10           {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.01079092}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-4.2822699}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. * Exercise 4
. asclogit dummy Price, case(Individual) alternatives(Brand)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7559.2014}  
Iteration 1:{space 3}log likelihood = {res:-7465.2594}  
Iteration 2:{space 3}log likelihood = {res:-7464.9321}  
Iteration 3:{space 3}log likelihood = {res:-7464.9321}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: Individual{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: Brand{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}1{txt}){col 67}= {res}   1458.85
{txt}Log likelihood = {res}-7464.9321{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       dummy{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Brand        {txt}{c |}
{space 7}Price {c |}{col 14}{res}{space 2}-6.656579{col 26}{space 2} .1742793{col 37}{space 1}  -38.19{col 46}{space 3}0.000{col 54}{space 4} -6.99816{col 67}{space 3}-6.314998
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.9543068{col 26}{space 2} .0500462{col 37}{space 1}  -19.07{col 46}{space 3}0.000{col 54}{space 4}-1.052396{col 67}{space 3} -.856218
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.296968{col 26}{space 2} .1086515{col 37}{space 1}   11.94{col 46}{space 3}0.000{col 54}{space 4} 1.084015{col 67}{space 3} 1.509921
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.717332{col 26}{space 2} .0541582{col 37}{space 1}  -31.71{col 46}{space 3}0.000{col 54}{space 4} -1.82348{col 67}{space 3}-1.611184
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.904005{col 26}{space 2} .0714605{col 37}{space 1}  -40.64{col 46}{space 3}0.000{col 54}{space 4}-3.044065{col 67}{space 3}-2.763945
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.515311{col 26}{space 2} .1262303{col 37}{space 1}  -12.00{col 46}{space 3}0.000{col 54}{space 4}-1.762718{col 67}{space 3}-1.267904
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2517684{col 26}{space 2}  .079164{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0966098{col 67}{space 3}  .406927
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.464868{col 26}{space 2} .1180467{col 37}{space 1}   12.41{col 46}{space 3}0.000{col 54}{space 4} 1.233501{col 67}{space 3} 1.696236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.357505{col 26}{space 2}  .133774{col 37}{space 1}   17.62{col 46}{space 3}0.000{col 54}{space 4} 2.095313{col 67}{space 3} 2.619697
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-3.896594{col 26}{space 2}  .177419{col 37}{space 1}  -21.96{col 46}{space 3}0.000{col 54}{space 4}-4.244328{col 67}{space 3}-3.548859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estat mfx
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .41862592
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-1.62007}}}{space 1}{space 1}{ralign 8:{res:{sf: .045076}}}{space 1}{space 1}{ralign 6:{res:{sf:-35.94}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.70841}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.53172}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .38092}}}{space 1}{space 1}{ralign 8:{res:{sf: .016377}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .348821}}}{space 1}{space 1}{ralign 8:{res:{sf: .413019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156526}}}{space 1}{space 1}{ralign 8:{res:{sf: .010709}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135537}}}{space 1}{space 1}{ralign 8:{res:{sf: .177515}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .359811}}}{space 1}{space 1}{ralign 8:{res:{sf: .016943}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .326602}}}{space 1}{space 1}{ralign 8:{res:{sf: .393019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .202435}}}{space 1}{space 1}{ralign 8:{res:{sf: .012376}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .178178}}}{space 1}{space 1}{ralign 8:{res:{sf: .226691}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .04471}}}{space 1}{space 1}{ralign 8:{res:{sf: .005301}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .034319}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0551}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .194866}}}{space 1}{space 1}{ralign 8:{res:{sf: .011804}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .171731}}}{space 1}{space 1}{ralign 8:{res:{sf: .218001}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .12222}}}{space 1}{space 1}{ralign 8:{res:{sf: .008972}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104636}}}{space 1}{space 1}{ralign 8:{res:{sf: .139804}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .14162}}}{space 1}{space 1}{ralign 8:{res:{sf: .009996}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .122027}}}{space 1}{space 1}{ralign 8:{res:{sf: .161213}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016959}}}{space 1}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011133}}}{space 1}{space 1}{ralign 8:{res:{sf: .022785}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .13669617
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .38092}}}{space 1}{space 1}{ralign 8:{res:{sf: .016377}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .348821}}}{space 1}{space 1}{ralign 8:{res:{sf: .413019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.785545}}}{space 1}{space 1}{ralign 8:{res:{sf: .030158}}}{space 1}{space 1}{ralign 6:{res:{sf:-26.05}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.844654}}}{space 1}{space 1}{ralign 8:{res:{sf:-.726436}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051111}}}{space 1}{space 1}{ralign 8:{res:{sf: .003765}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.57}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043731}}}{space 1}{space 1}{ralign 8:{res:{sf: .058492}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117491}}}{space 1}{space 1}{ralign 8:{res:{sf: .006448}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104853}}}{space 1}{space 1}{ralign 8:{res:{sf: .130129}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066102}}}{space 1}{space 1}{ralign 8:{res:{sf: .004433}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057414}}}{space 1}{space 1}{ralign 8:{res:{sf:  .07479}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014599}}}{space 1}{space 1}{ralign 8:{res:{sf: .001779}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.20}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011112}}}{space 1}{space 1}{ralign 8:{res:{sf: .018087}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063631}}}{space 1}{space 1}{ralign 8:{res:{sf: .004253}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055295}}}{space 1}{space 1}{ralign 8:{res:{sf: .071966}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .039909}}}{space 1}{space 1}{ralign 8:{res:{sf: .003145}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.69}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .033744}}}{space 1}{space 1}{ralign 8:{res:{sf: .046074}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .046244}}}{space 1}{space 1}{ralign 8:{res:{sf: .003507}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03937}}}{space 1}{space 1}{ralign 8:{res:{sf: .053118}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005538}}}{space 1}{space 1}{ralign 8:{res:{sf: .000986}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003605}}}{space 1}{space 1}{ralign 8:{res:{sf: .007471}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05617075
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156526}}}{space 1}{space 1}{ralign 8:{res:{sf: .010709}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135537}}}{space 1}{space 1}{ralign 8:{res:{sf: .177515}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051111}}}{space 1}{space 1}{ralign 8:{res:{sf: .003765}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.57}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043731}}}{space 1}{space 1}{ralign 8:{res:{sf: .058492}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.352903}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02284}}}{space 1}{space 1}{ralign 6:{res:{sf:-15.45}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.397668}}}{space 1}{space 1}{ralign 8:{res:{sf:-.308137}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048279}}}{space 1}{space 1}{ralign 8:{res:{sf: .003651}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041124}}}{space 1}{space 1}{ralign 8:{res:{sf: .055434}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027162}}}{space 1}{space 1}{ralign 8:{res:{sf: .002319}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022618}}}{space 1}{space 1}{ralign 8:{res:{sf: .031707}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005999}}}{space 1}{space 1}{ralign 8:{res:{sf: .000796}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004438}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00756}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .026147}}}{space 1}{space 1}{ralign 8:{res:{sf: .002223}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02179}}}{space 1}{space 1}{ralign 8:{res:{sf: .030504}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016399}}}{space 1}{space 1}{ralign 8:{res:{sf: .001554}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .013354}}}{space 1}{space 1}{ralign 8:{res:{sf: .019444}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019002}}}{space 1}{space 1}{ralign 8:{res:{sf: .001757}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015559}}}{space 1}{space 1}{ralign 8:{res:{sf: .022445}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002276}}}{space 1}{space 1}{ralign 8:{res:{sf: .000422}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.40}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001449}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .12912093
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .359811}}}{space 1}{space 1}{ralign 8:{res:{sf: .016943}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .326602}}}{space 1}{space 1}{ralign 8:{res:{sf: .393019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117491}}}{space 1}{space 1}{ralign 8:{res:{sf: .006448}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104853}}}{space 1}{space 1}{ralign 8:{res:{sf: .130129}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048279}}}{space 1}{space 1}{ralign 8:{res:{sf: .003651}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041124}}}{space 1}{space 1}{ralign 8:{res:{sf: .055434}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.748524}}}{space 1}{space 1}{ralign 8:{res:{sf: .031316}}}{space 1}{space 1}{ralign 6:{res:{sf:-23.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.809901}}}{space 1}{space 1}{ralign 8:{res:{sf:-.687146}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .062439}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00431}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.49}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .053992}}}{space 1}{space 1}{ralign 8:{res:{sf: .070886}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .01379}}}{space 1}{space 1}{ralign 8:{res:{sf: .001698}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.12}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .010462}}}{space 1}{space 1}{ralign 8:{res:{sf: .017118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060104}}}{space 1}{space 1}{ralign 8:{res:{sf: .004135}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:    .052}}}{space 1}{space 1}{ralign 8:{res:{sf: .068209}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .037698}}}{space 1}{space 1}{ralign 8:{res:{sf: .003025}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .031768}}}{space 1}{space 1}{ralign 8:{res:{sf: .043627}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043681}}}{space 1}{space 1}{ralign 8:{res:{sf: .003386}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .037046}}}{space 1}{space 1}{ralign 8:{res:{sf: .050317}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005231}}}{space 1}{space 1}{ralign 8:{res:{sf: .000933}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.60}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003402}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00706}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07264529
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .202435}}}{space 1}{space 1}{ralign 8:{res:{sf: .012376}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .178178}}}{space 1}{space 1}{ralign 8:{res:{sf: .226691}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066102}}}{space 1}{space 1}{ralign 8:{res:{sf: .004433}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057414}}}{space 1}{space 1}{ralign 8:{res:{sf:  .07479}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027162}}}{space 1}{space 1}{ralign 8:{res:{sf: .002319}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022618}}}{space 1}{space 1}{ralign 8:{res:{sf: .031707}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .062439}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00431}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.49}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .053992}}}{space 1}{space 1}{ralign 8:{res:{sf: .070886}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: -.44844}}}{space 1}{space 1}{ralign 8:{res:{sf: .025561}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.498539}}}{space 1}{space 1}{ralign 8:{res:{sf:-.398341}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007759}}}{space 1}{space 1}{ralign 8:{res:{sf: .001001}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005796}}}{space 1}{space 1}{ralign 8:{res:{sf: .009721}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033816}}}{space 1}{space 1}{ralign 8:{res:{sf: .002681}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028561}}}{space 1}{space 1}{ralign 8:{res:{sf: .039071}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .021209}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0019}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.16}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .017485}}}{space 1}{space 1}{ralign 8:{res:{sf: .024933}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024576}}}{space 1}{space 1}{ralign 8:{res:{sf: .002144}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020374}}}{space 1}{space 1}{ralign 8:{res:{sf: .028778}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002943}}}{space 1}{space 1}{ralign 8:{res:{sf: .000538}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001888}}}{space 1}{space 1}{ralign 8:{res:{sf: .003998}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01604447
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .04471}}}{space 1}{space 1}{ralign 8:{res:{sf: .005301}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .034319}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0551}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014599}}}{space 1}{space 1}{ralign 8:{res:{sf: .001779}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.20}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011112}}}{space 1}{space 1}{ralign 8:{res:{sf: .018087}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005999}}}{space 1}{space 1}{ralign 8:{res:{sf: .000796}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004438}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00756}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .01379}}}{space 1}{space 1}{ralign 8:{res:{sf: .001698}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.12}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .010462}}}{space 1}{space 1}{ralign 8:{res:{sf: .017118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007759}}}{space 1}{space 1}{ralign 8:{res:{sf: .001001}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005796}}}{space 1}{space 1}{ralign 8:{res:{sf: .009721}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.105088}}}{space 1}{space 1}{ralign 8:{res:{sf: .012245}}}{space 1}{space 1}{ralign 6:{res:{sf: -8.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.129087}}}{space 1}{space 1}{ralign 8:{res:{sf:-.081089}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007469}}}{space 1}{space 1}{ralign 8:{res:{sf: .000963}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005582}}}{space 1}{space 1}{ralign 8:{res:{sf: .009355}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004684}}}{space 1}{space 1}{ralign 8:{res:{sf: .000634}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003441}}}{space 1}{space 1}{ralign 8:{res:{sf: .005927}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005428}}}{space 1}{space 1}{ralign 8:{res:{sf: .000726}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004005}}}{space 1}{space 1}{ralign 8:{res:{sf: .006851}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00065}}}{space 1}{space 1}{ralign 8:{res:{sf: .000136}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.78}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 8:{res:{sf: .000916}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .06992927
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .194866}}}{space 1}{space 1}{ralign 8:{res:{sf: .011804}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .171731}}}{space 1}{space 1}{ralign 8:{res:{sf: .218001}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063631}}}{space 1}{space 1}{ralign 8:{res:{sf: .004253}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055295}}}{space 1}{space 1}{ralign 8:{res:{sf: .071966}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .026147}}}{space 1}{space 1}{ralign 8:{res:{sf: .002223}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02179}}}{space 1}{space 1}{ralign 8:{res:{sf: .030504}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060104}}}{space 1}{space 1}{ralign 8:{res:{sf: .004135}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:    .052}}}{space 1}{space 1}{ralign 8:{res:{sf: .068209}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033816}}}{space 1}{space 1}{ralign 8:{res:{sf: .002681}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028561}}}{space 1}{space 1}{ralign 8:{res:{sf: .039071}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007469}}}{space 1}{space 1}{ralign 8:{res:{sf: .000963}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005582}}}{space 1}{space 1}{ralign 8:{res:{sf: .009355}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.432938}}}{space 1}{space 1}{ralign 8:{res:{sf: .024519}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.66}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.480995}}}{space 1}{space 1}{ralign 8:{res:{sf:-.384882}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020416}}}{space 1}{space 1}{ralign 8:{res:{sf: .001828}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .016833}}}{space 1}{space 1}{ralign 8:{res:{sf: .023999}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023657}}}{space 1}{space 1}{ralign 8:{res:{sf: .002057}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019625}}}{space 1}{space 1}{ralign 8:{res:{sf: .027689}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000518}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001817}}}{space 1}{space 1}{ralign 8:{res:{sf: .003849}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res} .04385975
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .12222}}}{space 1}{space 1}{ralign 8:{res:{sf: .008972}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104636}}}{space 1}{space 1}{ralign 8:{res:{sf: .139804}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .039909}}}{space 1}{space 1}{ralign 8:{res:{sf: .003145}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.69}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .033744}}}{space 1}{space 1}{ralign 8:{res:{sf: .046074}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016399}}}{space 1}{space 1}{ralign 8:{res:{sf: .001554}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .013354}}}{space 1}{space 1}{ralign 8:{res:{sf: .019444}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .037698}}}{space 1}{space 1}{ralign 8:{res:{sf: .003025}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .031768}}}{space 1}{space 1}{ralign 8:{res:{sf: .043627}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .021209}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0019}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.16}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .017485}}}{space 1}{space 1}{ralign 8:{res:{sf: .024933}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004684}}}{space 1}{space 1}{ralign 8:{res:{sf: .000634}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003441}}}{space 1}{space 1}{ralign 8:{res:{sf: .005927}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020416}}}{space 1}{space 1}{ralign 8:{res:{sf: .001828}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .016833}}}{space 1}{space 1}{ralign 8:{res:{sf: .023999}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.279151}}}{space 1}{space 1}{ralign 8:{res:{sf: .019602}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: -.31757}}}{space 1}{space 1}{ralign 8:{res:{sf:-.240731}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014838}}}{space 1}{space 1}{ralign 8:{res:{sf: .001434}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.35}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012027}}}{space 1}{space 1}{ralign 8:{res:{sf: .017649}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001777}}}{space 1}{space 1}{ralign 8:{res:{sf: .000334}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001123}}}{space 1}{space 1}{ralign 8:{res:{sf: .002431}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .05082152
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .14162}}}{space 1}{space 1}{ralign 8:{res:{sf: .009996}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .122027}}}{space 1}{space 1}{ralign 8:{res:{sf: .161213}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .046244}}}{space 1}{space 1}{ralign 8:{res:{sf: .003507}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03937}}}{space 1}{space 1}{ralign 8:{res:{sf: .053118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019002}}}{space 1}{space 1}{ralign 8:{res:{sf: .001757}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015559}}}{space 1}{space 1}{ralign 8:{res:{sf: .022445}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043681}}}{space 1}{space 1}{ralign 8:{res:{sf: .003386}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .037046}}}{space 1}{space 1}{ralign 8:{res:{sf: .050317}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024576}}}{space 1}{space 1}{ralign 8:{res:{sf: .002144}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020374}}}{space 1}{space 1}{ralign 8:{res:{sf: .028778}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005428}}}{space 1}{space 1}{ralign 8:{res:{sf: .000726}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004005}}}{space 1}{space 1}{ralign 8:{res:{sf: .006851}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023657}}}{space 1}{space 1}{ralign 8:{res:{sf: .002057}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019625}}}{space 1}{space 1}{ralign 8:{res:{sf: .027689}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014838}}}{space 1}{space 1}{ralign 8:{res:{sf: .001434}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.35}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012027}}}{space 1}{space 1}{ralign 8:{res:{sf: .017649}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.321105}}}{space 1}{space 1}{ralign 8:{res:{sf: .021545}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.363332}}}{space 1}{space 1}{ralign 8:{res:{sf:-.278878}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002059}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001306}}}{space 1}{space 1}{ralign 8:{res:{sf: .002811}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00608591
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016959}}}{space 1}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011133}}}{space 1}{space 1}{ralign 8:{res:{sf: .022785}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005538}}}{space 1}{space 1}{ralign 8:{res:{sf: .000986}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003605}}}{space 1}{space 1}{ralign 8:{res:{sf: .007471}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002276}}}{space 1}{space 1}{ralign 8:{res:{sf: .000422}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.40}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001449}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005231}}}{space 1}{space 1}{ralign 8:{res:{sf: .000933}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.60}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003402}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00706}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002943}}}{space 1}{space 1}{ralign 8:{res:{sf: .000538}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001888}}}{space 1}{space 1}{ralign 8:{res:{sf: .003998}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00065}}}{space 1}{space 1}{ralign 8:{res:{sf: .000136}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.78}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 8:{res:{sf: .000916}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000518}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001817}}}{space 1}{space 1}{ralign 8:{res:{sf: .003849}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001777}}}{space 1}{space 1}{ralign 8:{res:{sf: .000334}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001123}}}{space 1}{space 1}{ralign 8:{res:{sf: .002431}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002059}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001306}}}{space 1}{space 1}{ralign 8:{res:{sf: .002811}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.040265}}}{space 1}{space 1}{ralign 8:{res:{sf: .007011}}}{space 1}{space 1}{ralign 6:{res:{sf: -5.74}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.054006}}}{space 1}{space 1}{ralign 8:{res:{sf:-.026523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. 
. asclogit dummy, case(Individual) alternatives(Brand) casevar(income)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-8328.1129}  
Iteration 1:{space 3}log likelihood = {res:-8236.9407}  
Iteration 2:{space 3}log likelihood = {res: -8236.757}  
Iteration 3:{space 3}log likelihood = {res: -8236.757}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: Individual{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: Brand{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}    101.55
{txt}Log likelihood = {res} -8236.757{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       dummy{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0030887{col 26}{space 2}  .003114{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4} -.009192{col 67}{space 3} .0030145
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8453241{col 26}{space 2} .0931354{col 37}{space 1}   -9.08{col 46}{space 3}0.000{col 54}{space 4}-1.027866{col 67}{space 3} -.662782
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0145862{col 26}{space 2} .0038255{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0070885{col 67}{space 3}  .022084
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.399858{col 26}{space 2} .1335802{col 37}{space 1}  -17.97{col 46}{space 3}0.000{col 54}{space 4} -2.66167{col 67}{space 3}-2.138045
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040504{col 26}{space 2} .0030926{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-.0020109{col 67}{space 3} .0101118
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.201326{col 26}{space 2} .0971021{col 37}{space 1}  -12.37{col 46}{space 3}0.000{col 54}{space 4}-1.391643{col 67}{space 3} -1.01101
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0012536{col 26}{space 2} .0042024{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-.0094901{col 67}{space 3} .0069829
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.690582{col 26}{space 2} .1269952{col 37}{space 1}  -13.31{col 46}{space 3}0.000{col 54}{space 4}-1.939488{col 67}{space 3}-1.441676
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .030612{col 26}{space 2}  .004674{col 37}{space 1}    6.55{col 46}{space 3}0.000{col 54}{space 4} .0214512{col 67}{space 3} .0397729
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.139767{col 26}{space 2}  .210989{col 37}{space 1}  -19.62{col 46}{space 3}0.000{col 54}{space 4}-4.553298{col 67}{space 3}-3.726236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0069326{col 26}{space 2} .0044161{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4} -.015588{col 67}{space 3} .0017228
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.531042{col 26}{space 2} .1280434{col 37}{space 1}  -11.96{col 46}{space 3}0.000{col 54}{space 4}-1.782002{col 67}{space 3}-1.280081
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0228862{col 26}{space 2} .0036217{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} .0157878{col 67}{space 3} .0299845
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.848352{col 26}{space 2} .1393848{col 37}{space 1}  -20.44{col 46}{space 3}0.000{col 54}{space 4}-3.121541{col 67}{space 3}-2.575163
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .017743{col 26}{space 2} .0037623{col 37}{space 1}    4.72{col 46}{space 3}0.000{col 54}{space 4}  .010369{col 67}{space 3} .0251169
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.575597{col 26}{space 2}   .13614{col 37}{space 1}  -18.92{col 46}{space 3}0.000{col 54}{space 4}-2.842427{col 67}{space 3}-2.308768
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0107909{col 26}{space 2}   .01013{col 37}{space 1}    1.07{col 46}{space 3}0.287{col 54}{space 4}-.0090636{col 67}{space 3} .0306454
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.28227{col 26}{space 2}  .345792{col 37}{space 1}  -12.38{col 46}{space 3}0.000{col 54}{space 4} -4.96001{col 67}{space 3} -3.60453
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estat mfx
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .39801715
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.001062}}}{space 1}{space 1}{ralign 8:{res:{sf: .000487}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.029}}}{space 1}{space 1}{ralign 8:{res:{sf:-.002016}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000108}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .15691817
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000904}}}{space 1}{space 1}{ralign 8:{res:{sf: .000378}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.017}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001645}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000162}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05406295
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000644}}}{space 1}{space 1}{ralign 8:{res:{sf: .000183}}}{space 1}{space 1}{ralign 6:{res:{sf:  3.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000286}}}{space 1}{space 1}{ralign 8:{res:{sf: .001002}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .13391688
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000185}}}{space 1}{space 1}{ralign 8:{res:{sf: .000329}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.574}}}{space 1}{space 1}{ralign 8:{res:{sf: -.00046}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00083}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07089742
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000278}}}{space 1}{space 1}{ralign 8:{res:{sf: .000264}}}{space 1}{space 1}{ralign 6:{res:{sf: -1.06}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.291}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000795}}}{space 1}{space 1}{ralign 8:{res:{sf: .000238}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01478443
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000413}}}{space 1}{space 1}{ralign 8:{res:{sf: .000066}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000283}}}{space 1}{space 1}{ralign 8:{res:{sf: .000543}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .07107045
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000682}}}{space 1}{space 1}{ralign 8:{res:{sf: .000277}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.014}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001224}}}{space 1}{space 1}{ralign 8:{res:{sf: -.00014}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res} .04343487
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000878}}}{space 1}{space 1}{ralign 8:{res:{sf: .000138}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.38}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000608}}}{space 1}{space 1}{ralign 8:{res:{sf: .001148}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .04948833
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000746}}}{space 1}{space 1}{ralign 8:{res:{sf: .000164}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.55}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000425}}}{space 1}{space 1}{ralign 8:{res:{sf: .001067}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00740936
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00006}}}{space 1}{space 1}{ralign 8:{res:{sf: .000074}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.413}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000084}}}{space 1}{space 1}{ralign 8:{res:{sf: .000204}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. 
. * Exercise 5
. * Mixed Logit 
. 
. * Implementing Mixed Logit
. asclogit dummy Price, case(Individual) alternatives(Brand) casevar(income)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7513.4717}  
Iteration 1:{space 3}log likelihood = {res:-7418.3161}  
Iteration 2:{space 3}log likelihood = {res:-7417.9325}  
Iteration 3:{space 3}log likelihood = {res:-7417.9325}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: Individual{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: Brand{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}10{txt}){col 67}= {res}   1538.10
{txt}Log likelihood = {res}-7417.9325{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       dummy{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Brand        {txt}{c |}
{space 7}Price {c |}{col 14}{res}{space 2}-6.659669{col 26}{space 2} .1747698{col 37}{space 1}  -38.11{col 46}{space 3}0.000{col 54}{space 4}-7.002212{col 67}{space 3}-6.317127
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0042599{col 26}{space 2} .0034392{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.0110007{col 67}{space 3} .0024808
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8406734{col 26}{space 2} .1038446{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4}-1.044205{col 67}{space 3}-.6371417
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .014344{col 26}{space 2} .0039221{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .0066568{col 67}{space 3} .0220311
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8886069{col 26}{space 2} .1594585{col 37}{space 1}    5.57{col 46}{space 3}0.000{col 54}{space 4} .5760739{col 67}{space 3}  1.20114
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040998{col 26}{space 2} .0032042{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.0021803{col 67}{space 3}   .01038
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.828492{col 26}{space 2}  .103218{col 37}{space 1}  -17.71{col 46}{space 3}0.000{col 54}{space 4}-2.030795{col 67}{space 3}-1.626188
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0011829{col 26}{space 2} .0042971{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4} -.009605{col 67}{space 3} .0072393
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -2.87341{col 26}{space 2} .1347573{col 37}{space 1}  -21.32{col 46}{space 3}0.000{col 54}{space 4} -3.13753{col 67}{space 3}-2.609291
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0298089{col 26}{space 2} .0047267{col 37}{space 1}    6.31{col 46}{space 3}0.000{col 54}{space 4} .0205448{col 67}{space 3} .0390731
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.457119{col 26}{space 2}  .215426{col 37}{space 1}  -11.41{col 46}{space 3}0.000{col 54}{space 4}-2.879346{col 67}{space 3}-2.034891
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0092456{col 26}{space 2} .0045935{col 37}{space 1}   -2.01{col 46}{space 3}0.044{col 54}{space 4}-.0182487{col 67}{space 3}-.0002425
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4968692{col 26}{space 2} .1424824{col 37}{space 1}    3.49{col 46}{space 3}0.000{col 54}{space 4} .2176089{col 67}{space 3} .7761295
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0219965{col 26}{space 2} .0038203{col 37}{space 1}    5.76{col 46}{space 3}0.000{col 54}{space 4} .0145088{col 67}{space 3} .0294841
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   .80306{col 26}{space 2} .1709199{col 37}{space 1}    4.70{col 46}{space 3}0.000{col 54}{space 4} .4680631{col 67}{space 3} 1.138057
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0169911{col 26}{space 2} .0039155{col 37}{space 1}    4.34{col 46}{space 3}0.000{col 54}{space 4} .0093169{col 67}{space 3} .0246653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.864125{col 26}{space 2} .1799469{col 37}{space 1}   10.36{col 46}{space 3}0.000{col 54}{space 4} 1.511436{col 67}{space 3} 2.216815
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0087596{col 26}{space 2} .0103007{col 37}{space 1}    0.85{col 46}{space 3}0.395{col 54}{space 4}-.0114295{col 67}{space 3} .0289487
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.142386{col 26}{space 2} .3506563{col 37}{space 1}  -11.81{col 46}{space 3}0.000{col 54}{space 4}-4.829659{col 67}{space 3}-3.455112
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto mixed_logit
{txt}
{com}. est tab mixed_logit
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:mixed_lo~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}Brand        {txt}{c |}{res}
{txt}{space 7}Price {c |}{res} {ralign 10:-6.6596692}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}2            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:-.00425993}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-.84067337}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}3            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.01434397}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.88860693}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}4            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.00409985}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.8284916}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}5            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:-.00118286}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-2.8734104}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}6            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.02980895}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-2.4571185}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}7            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:-.00924559}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.49686917}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}8            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.02199646}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.80306}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}9            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.01699109}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.8641255}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}10           {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.00875958}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-4.1423856}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. gen F_logLikelihood = e(ll)
{txt}
{com}. 
. asclogit dummy Price if Brand != 10, case(Individual) alternatives(Brand) ///
> casevar(income)
{txt}{p 0 6 2}note: 33 cases{txt} (297 obs) dropped due to no positive outcome  per case{p_end}
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7338.0067}  
Iteration 1:{space 3}log likelihood = {res:-7240.5947}  
Iteration 2:{space 3}log likelihood = {res:-7240.2035}  
Iteration 3:{space 3}log likelihood = {res:-7240.2035}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    39,933
{txt}Case variable: Individual{col 48}Number of cases{col 67}= {res}      4437

{txt}Alternative variable: Brand{col 48}Alts per case: min = {res}         9
{col 63}{txt}avg = {res}       9.0
{col 63}{txt}max = {res}         9

{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}   1496.86
{txt}Log likelihood = {res}-7240.2035{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       dummy{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Brand        {txt}{c |}
{space 7}Price {c |}{col 14}{res}{space 2}-6.662263{col 26}{space 2} .1773451{col 37}{space 1}  -37.57{col 46}{space 3}0.000{col 54}{space 4}-7.009853{col 67}{space 3}-6.314673
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0041388{col 26}{space 2} .0034332{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-.0108678{col 67}{space 3} .0025901
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8456784{col 26}{space 2} .1037222{col 37}{space 1}   -8.15{col 46}{space 3}0.000{col 54}{space 4} -1.04897{col 67}{space 3}-.6423866
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0142684{col 26}{space 2} .0039131{col 37}{space 1}    3.65{col 46}{space 3}0.000{col 54}{space 4} .0065989{col 67}{space 3} .0219379
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8902285{col 26}{space 2} .1598555{col 37}{space 1}    5.57{col 46}{space 3}0.000{col 54}{space 4} .5769175{col 67}{space 3} 1.203539
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040389{col 26}{space 2} .0031968{col 37}{space 1}    1.26{col 46}{space 3}0.206{col 54}{space 4}-.0022266{col 67}{space 3} .0103045
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.827246{col 26}{space 2} .1030859{col 37}{space 1}  -17.73{col 46}{space 3}0.000{col 54}{space 4}-2.029291{col 67}{space 3}-1.625201
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0012321{col 26}{space 2} .0042866{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-.0096337{col 67}{space 3} .0071695
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.873897{col 26}{space 2} .1346734{col 37}{space 1}  -21.34{col 46}{space 3}0.000{col 54}{space 4}-3.137852{col 67}{space 3}-2.609942
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0297055{col 26}{space 2} .0047194{col 37}{space 1}    6.29{col 46}{space 3}0.000{col 54}{space 4} .0204558{col 67}{space 3} .0389553
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.455586{col 26}{space 2} .2153077{col 37}{space 1}  -11.41{col 46}{space 3}0.000{col 54}{space 4}-2.877582{col 67}{space 3}-2.033591
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0092135{col 26}{space 2} .0045835{col 37}{space 1}   -2.01{col 46}{space 3}0.044{col 54}{space 4} -.018197{col 67}{space 3}  -.00023
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4953166{col 26}{space 2} .1424907{col 37}{space 1}    3.48{col 46}{space 3}0.001{col 54}{space 4} .2160399{col 67}{space 3} .7745933
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0218706{col 26}{space 2}  .003812{col 37}{space 1}    5.74{col 46}{space 3}0.000{col 54}{space 4} .0143992{col 67}{space 3} .0293419
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8065785{col 26}{space 2} .1713693{col 37}{space 1}    4.71{col 46}{space 3}0.000{col 54}{space 4} .4707009{col 67}{space 3} 1.142456
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0168581{col 26}{space 2} .0039069{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0092007{col 67}{space 3} .0245155
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.868468{col 26}{space 2} .1807678{col 37}{space 1}   10.34{col 46}{space 3}0.000{col 54}{space 4}  1.51417{col 67}{space 3} 2.222767
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto removed_mixed_logit
{txt}
{com}. est tab removed_mixed_logit
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:removed_~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}Brand        {txt}{c |}{res}
{txt}{space 7}Price {c |}{res} {ralign 10:-6.6622633}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}2            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:-.00413883}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-.84567838}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}3            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.01426839}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.89022846}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}4            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.00403891}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.8272458}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}5            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:-.00123207}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-2.8738974}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}6            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.02970554}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-2.4555863}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}7            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:-.00921348}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.49531656}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}8            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.02187057}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.80657854}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}9            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:.01685812}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.8684682}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. gen R_logLikelihood = e(ll)
{txt}
{com}. 
. * Test Statitiscs
. gen MTT = -2 * (F_logLikelihood - R_logLikelihood)
{txt}
{com}. 
. * Testing IIA
. hausman mixed_logit removed_mixed_logit

{txt}{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17}mixed_logit {col 30}removed_mi~t{col 46}Difference{col 66}S.E.
{hline 13}{c +}{hline 64}
{space 7}Price {c |}{res}{col 18}-6.659669{col 31}-6.662263{col 47} .0025942{col 63}        .
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = consistent under Ho and Ha; obtained from asclogit}
{ralign 78:B = inconsistent under Ha, efficient under Ho; obtained from asclogit}

    Test:  Ho:  difference in coefficients not systematic

{ralign 25:chi2({res:1})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 27}={res}    -0.01{txt}{col 41}chi2<0 ==> model fitted on these
{col 41}data fails to meet the asymptotic
{col 41}assumptions of the Hausman test;
{col 41}see {help suest##|_new:suest} for a generalized test

{com}. di r(p)
{res}1
{txt}
{com}. *** We conclude that the IIA holds.
. 
. ******
. *HW 4*
. ******
. 
. * Exercise 1
. 
. *Importing Koop-Tobias Data
. insheet using "/Users/minchel93/Desktop/ECON-613/Koop-Tobias.csv", clear
{txt}(10 vars, 17,919 obs)

{com}. 
. * Setting Panel 
. xtset personid timetrnd
{res}{txt}{col 8}panel variable:  {res}personid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}timetrnd, 0 to 14, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. * Investigating the Panel Dimension of Data
. xtdes

{txt}personid:  {res}1{txt}, {res}2{txt}, ..., {res}2178                                   {txt}n ={res}       2178
{txt}timetrnd:  {res}0, 1, ..., 14                                     {txt}T ={res}         15
           {txt}Delta(timetrnd) = {res}1 unit
           {txt}Span(timetrnd)  = {res}15 periods
           {txt}(personid*timetrnd uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     1       2       5         8        11      14      15

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 15}
{res}       93      4.27    4.27{txt} {c |}  {res}111111111111111
       46      2.11    6.38{txt} {c |}  {res}........1111111
       45      2.07    8.45{txt} {c |}  {res}......111111111
       44      2.02   10.47{txt} {c |}  {res}.......11111111
       43      1.97   12.44{txt} {c |}  {res}.11111111111111
       42      1.93   14.37{txt} {c |}  {res}..1111111111111
       36      1.65   16.02{txt} {c |}  {res}....11111111111
       35      1.61   17.63{txt} {c |}  {res}...111111111111
       30      1.38   19.01{txt} {c |}  {res}..........11111
     1764     80.99  100.00{txt} {c |} (other patterns)
 {hline 27}{c +}{c -}{c -}{hline 15}
{res}     2178    100.00        {txt} {c |}  {res}XXXXXXXXXXXXXXX
{txt}
{com}. 
. * Exercise 2
. 
. * Declaring Global Variables
. global yvar "logwage"
{txt}
{com}. global xvars "educ potexper"
{txt}
{com}. 
. * Random Effects Model
. xtreg $yvar $xvars, re
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}    17,919
{txt}Group variable: {res}personid                        {txt}Number of groups  = {res}     2,178

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1961                                         {txt}min = {res}         1
{txt}     between = {res}0.1533                                         {txt}avg = {res}       8.2
{txt}     overall = {res}0.1578                                         {txt}max = {res}        15

                                                {txt}Wald chi2({res}2{txt})      =  {res}  4209.96
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .107938{col 26}{space 2} .0033832{col 37}{space 1}   31.90{col 46}{space 3}0.000{col 54}{space 4} .1013071{col 67}{space 3}  .114569
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0387645{col 26}{space 2} .0007178{col 37}{space 1}   54.00{col 46}{space 3}0.000{col 54}{space 4} .0373576{col 67}{space 3} .0401714
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5635206{col 26}{space 2} .0438846{col 37}{space 1}   12.84{col 46}{space 3}0.000{col 54}{space 4} .4775083{col 67}{space 3} .6495328
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .37207276
     {txt}sigma_e {c |} {res} .33545728
         {txt}rho {c |} {res}  .5516129{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. est sto RE_model
{txt}
{com}. est tab RE_model
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:RE_model} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 8}educ {c |}{res} {ralign 10:.10793802}{txt} {space 1}
{res}{txt}{space 4}potexper {c |}{res} {ralign 10:.03876449}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.56352057}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. * Exercise 3
. 
. * Between Model
. xtreg $yvar $xvars, be

{txt}Between regression (regression on group means)  Number of obs     = {res}    17,919
{txt}Group variable: {res}personid                        {txt}Number of groups  = {res}     2,178

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1962                                         {txt}min = {res}         1
{txt}     between = {res}0.1553                                         {txt}avg = {res}       8.2
{txt}     overall = {res}0.1518                                         {txt}max = {res}        15

                                                {txt}F({res}2{txt},{res}2175{txt})         =  {res}   200.01
{txt}sd(u_i + avg(e_i.))= {res} .3991313                  {txt}Prob > F          =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .0930999{col 26}{space 2} .0046685{col 37}{space 1}   19.94{col 46}{space 3}0.000{col 54}{space 4} .0839447{col 67}{space 3} .1022551
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0259987{col 26}{space 2} .0036049{col 37}{space 1}    7.21{col 46}{space 3}0.000{col 54}{space 4} .0189294{col 67}{space 3} .0330681
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8455688{col 26}{space 2} .0770179{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .6945324{col 67}{space 3} .9966052
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto BE_model
{txt}
{com}. est tab BE_model
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:BE_model} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 8}educ {c |}{res} {ralign 10:.09309987}{txt} {space 1}
{res}{txt}{space 4}potexper {c |}{res} {ralign 10:.02599874}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.84556882}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. * Within Model
. xtreg $yvar $xvars, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,919
{txt}Group variable: {res}personid{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,178

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1964{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1550{col 63}{txt}avg{col 67}={col 69}{res}       8.2
{txt}     overall = {res}0.1551{col 63}{txt}max{col 67}={col 69}{res}        15

{txt}{col 49}F({res}2{txt},{res}15739{txt}){col 67}={col 70}{res}  1923.47
{txt}corr(u_i, Xb){col 16}= {res}-0.1273{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .123662{col 26}{space 2} .0057619{col 37}{space 1}   21.46{col 46}{space 3}0.000{col 54}{space 4} .1123681{col 67}{space 3} .1349559
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0385611{col 26}{space 2} .0007585{col 37}{space 1}   50.84{col 46}{space 3}0.000{col 54}{space 4} .0370744{col 67}{space 3} .0400478
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4068016{col 26}{space 2} .0717348{col 37}{space 1}    5.67{col 46}{space 3}0.000{col 54}{space 4} .2661931{col 67}{space 3}   .54741
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .40290853
     {txt}sigma_e {c |} {res} .33545728
         {txt}rho {c |} {res} .59059603{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}2177{txt}, {res}15739{txt}) = {res}9.95{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. est sto Within_model
{txt}
{com}. est tab Within_model
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Within_m~l} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 8}educ {c |}{res} {ralign 10:.12366202}{txt} {space 1}
{res}{txt}{space 4}potexper {c |}{res} {ralign 10:.03856107}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.40680158}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. * First-Difference Model
. gen educ_diff = educ - L.educ
{txt}(4,235 missing values generated)

{com}. gen potexper_diff = potexper - L.potexper
{txt}(4,235 missing values generated)

{com}. gen logwage_diff = logwage - L.logwage
{txt}(4,235 missing values generated)

{com}. 
. reg logwage_diff educ_diff potexper_diff, nocon

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    13,684
{txt}{hline 13}{c +}{hline 34}   F(2, 13682)     = {res}   171.87
{txt}       Model {c |} {res} 38.7282937         2  19.3641469   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1541.54171    13,682  .112669326   {txt}R-squared       ={res}    0.0245
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0244
{txt}       Total {c |} {res} 1580.27001    13,684  .115483046   {txt}Root MSE        =   {res} .33566

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} logwage_diff{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}educ_diff {c |}{col 15}{res}{space 2} .0431084{col 27}{space 2} .0151792{col 38}{space 1}    2.84{col 47}{space 3}0.005{col 55}{space 4} .0133551{col 68}{space 3} .0728617
{txt}potexper_diff {c |}{col 15}{res}{space 2} .0535369{col 27}{space 2} .0029221{col 38}{space 1}   18.32{col 47}{space 3}0.000{col 55}{space 4} .0478092{col 68}{space 3} .0592647
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto Difference_model
{txt}
{com}. est tab Difference_model
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Differen~l} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 3}educ_diff {c |}{res} {ralign 10:.04310838}{txt} {space 1}
{res}{txt}potexper_d~f {c |}{res} {ralign 10:.05353695}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. 
. 
. * Exercise 4
. preserve
{txt}
{com}. 
. ** Question 1
. * Finding unique PERSONID
. tempfile unique_id
{txt}
{com}. bysort personid: keep if _n == 1
{txt}(15,741 observations deleted)

{com}. 
. * Sampling 100 Individuals
. sample 100, count
{txt}(2,078 observations deleted)

{com}. sort personid
{txt}
{com}. save `unique_id', replace
{txt}(note: file /var/folders/57/dmhskc9s4rx_z7pd0ykzx5yw0000gn/T//S_04354.000002 not found)
file /var/folders/57/dmhskc9s4rx_z7pd0ykzx5yw0000gn/T//S_04354.000002 saved

{com}. 
. * Subsetting Data
. restore
{txt}
{com}. merge m:1 personid using `unique_id'
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          17,061
{txt}{col 9}from master{col 30}{res}          17,061{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             858{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge == 3
{txt}(17,061 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. * Updating Global Variables
. global yvar2 "logwage"
{txt}
{com}. global xvars2 "educ potexper"
{txt}
{com}. 
. * Estimating Fixed Effects
. reg $yvar2 i.personid $xvars2 , nocon vce(robust) 

{txt}Linear regression                               Number of obs     = {res}       858
                                                {txt}{help j_robustsingular:F(99, 757) }       =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.9813
                                                {txt}Root MSE          =    {res} .33856

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}personid {c |}
{space 9}43  {c |}{col 14}{res}{space 2} .2559013{col 26}{space 2} .2139443{col 37}{space 1}    1.20{col 46}{space 3}0.232{col 54}{space 4}-.1640933{col 67}{space 3} .6758958
{txt}{space 9}73  {c |}{col 14}{res}{space 2}-.0624686{col 26}{space 2} .1740352{col 37}{space 1}   -0.36{col 46}{space 3}0.720{col 54}{space 4}-.4041176{col 67}{space 3} .2791805
{txt}{space 9}78  {c |}{col 14}{res}{space 2} .2618647{col 26}{space 2} .2535708{col 37}{space 1}    1.03{col 46}{space 3}0.302{col 54}{space 4}-.2359209{col 67}{space 3} .7596502
{txt}{space 9}96  {c |}{col 14}{res}{space 2} .4076079{col 26}{space 2} .1380487{col 37}{space 1}    2.95{col 46}{space 3}0.003{col 54}{space 4} .1366041{col 67}{space 3} .6786116
{txt}{space 8}116  {c |}{col 14}{res}{space 2} .3113191{col 26}{space 2} .1872607{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0562928{col 67}{space 3}  .678931
{txt}{space 8}118  {c |}{col 14}{res}{space 2} .7802285{col 26}{space 2} .1046927{col 37}{space 1}    7.45{col 46}{space 3}0.000{col 54}{space 4}  .574706{col 67}{space 3}  .985751
{txt}{space 8}156  {c |}{col 14}{res}{space 2}-.0262156{col 26}{space 2} .1485977{col 37}{space 1}   -0.18{col 46}{space 3}0.860{col 54}{space 4}-.3179282{col 67}{space 3} .2654969
{txt}{space 8}188  {c |}{col 14}{res}{space 2}-.3591187{col 26}{space 2}   .19371{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-.7393914{col 67}{space 3} .0211539
{txt}{space 8}193  {c |}{col 14}{res}{space 2}  .228625{col 26}{space 2}  .165969{col 37}{space 1}    1.38{col 46}{space 3}0.169{col 54}{space 4}-.0971892{col 67}{space 3} .5544391
{txt}{space 8}212  {c |}{col 14}{res}{space 2}-.6631958{col 26}{space 2} .1890094{col 37}{space 1}   -3.51{col 46}{space 3}0.000{col 54}{space 4}-1.034241{col 67}{space 3}-.2921509
{txt}{space 8}226  {c |}{col 14}{res}{space 2} .4477821{col 26}{space 2} .1441274{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} .1648452{col 67}{space 3} .7307191
{txt}{space 8}247  {c |}{col 14}{res}{space 2}-.4877445{col 26}{space 2} .1949071{col 37}{space 1}   -2.50{col 46}{space 3}0.013{col 54}{space 4}-.8703671{col 67}{space 3}-.1051218
{txt}{space 8}248  {c |}{col 14}{res}{space 2} .4869323{col 26}{space 2} .1598786{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4} .1730741{col 67}{space 3} .8007905
{txt}{space 8}256  {c |}{col 14}{res}{space 2} .8883846{col 26}{space 2}  .126315{col 37}{space 1}    7.03{col 46}{space 3}0.000{col 54}{space 4} .6404152{col 67}{space 3} 1.136354
{txt}{space 8}259  {c |}{col 14}{res}{space 2}  .837445{col 26}{space 2} .1792418{col 37}{space 1}    4.67{col 46}{space 3}0.000{col 54}{space 4} .4855749{col 67}{space 3} 1.189315
{txt}{space 8}279  {c |}{col 14}{res}{space 2} .2718268{col 26}{space 2} .1490993{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-.0208705{col 67}{space 3} .5645241
{txt}{space 8}284  {c |}{col 14}{res}{space 2} .1065064{col 26}{space 2} .1571935{col 37}{space 1}    0.68{col 46}{space 3}0.498{col 54}{space 4}-.2020805{col 67}{space 3} .4150933
{txt}{space 8}354  {c |}{col 14}{res}{space 2} .0228767{col 26}{space 2} .1075356{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-.1882267{col 67}{space 3}   .23398
{txt}{space 8}370  {c |}{col 14}{res}{space 2}  .328799{col 26}{space 2} .2036503{col 37}{space 1}    1.61{col 46}{space 3}0.107{col 54}{space 4}-.0709874{col 67}{space 3} .7285854
{txt}{space 8}396  {c |}{col 14}{res}{space 2} .4590759{col 26}{space 2} .2504373{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.0325582{col 67}{space 3}   .95071
{txt}{space 8}410  {c |}{col 14}{res}{space 2} -.118949{col 26}{space 2} .1450844{col 37}{space 1}   -0.82{col 46}{space 3}0.413{col 54}{space 4}-.4037645{col 67}{space 3} .1658665
{txt}{space 8}412  {c |}{col 14}{res}{space 2} .2233827{col 26}{space 2}  .136731{col 37}{space 1}    1.63{col 46}{space 3}0.103{col 54}{space 4}-.0450344{col 67}{space 3} .4917998
{txt}{space 8}413  {c |}{col 14}{res}{space 2} .4858604{col 26}{space 2} .1464302{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .1984029{col 67}{space 3} .7733179
{txt}{space 8}417  {c |}{col 14}{res}{space 2} .1314769{col 26}{space 2} .1710754{col 37}{space 1}    0.77{col 46}{space 3}0.442{col 54}{space 4}-.2043617{col 67}{space 3} .4673155
{txt}{space 8}458  {c |}{col 14}{res}{space 2}-.0237871{col 26}{space 2} .1582833{col 37}{space 1}   -0.15{col 46}{space 3}0.881{col 54}{space 4}-.3345135{col 67}{space 3} .2869394
{txt}{space 8}468  {c |}{col 14}{res}{space 2} .3988128{col 26}{space 2} .1847841{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0360627{col 67}{space 3} .7615629
{txt}{space 8}479  {c |}{col 14}{res}{space 2} .0402505{col 26}{space 2} .1505143{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-.2552245{col 67}{space 3} .3357255
{txt}{space 8}494  {c |}{col 14}{res}{space 2} .5984066{col 26}{space 2} .1710674{col 37}{space 1}    3.50{col 46}{space 3}0.000{col 54}{space 4} .2625838{col 67}{space 3} .9342295
{txt}{space 8}505  {c |}{col 14}{res}{space 2} .9894219{col 26}{space 2} .1381278{col 37}{space 1}    7.16{col 46}{space 3}0.000{col 54}{space 4} .7182629{col 67}{space 3} 1.260581
{txt}{space 8}515  {c |}{col 14}{res}{space 2} .0702391{col 26}{space 2} .2107113{col 37}{space 1}    0.33{col 46}{space 3}0.739{col 54}{space 4}-.3434088{col 67}{space 3} .4838871
{txt}{space 8}528  {c |}{col 14}{res}{space 2}-.3206643{col 26}{space 2} .1356046{col 37}{space 1}   -2.36{col 46}{space 3}0.018{col 54}{space 4}-.5868702{col 67}{space 3}-.0544585
{txt}{space 8}533  {c |}{col 14}{res}{space 2} .5093916{col 26}{space 2} .1808084{col 37}{space 1}    2.82{col 46}{space 3}0.005{col 54}{space 4} .1544462{col 67}{space 3} .8643371
{txt}{space 8}557  {c |}{col 14}{res}{space 2} .7394056{col 26}{space 2} .1550346{col 37}{space 1}    4.77{col 46}{space 3}0.000{col 54}{space 4} .4350567{col 67}{space 3} 1.043754
{txt}{space 8}568  {c |}{col 14}{res}{space 2}-.1366041{col 26}{space 2} .2233843{col 37}{space 1}   -0.61{col 46}{space 3}0.541{col 54}{space 4}-.5751305{col 67}{space 3} .3019222
{txt}{space 8}609  {c |}{col 14}{res}{space 2} .3713916{col 26}{space 2}  .258863{col 37}{space 1}    1.43{col 46}{space 3}0.152{col 54}{space 4}-.1367831{col 67}{space 3} .8795662
{txt}{space 8}615  {c |}{col 14}{res}{space 2}-.2844674{col 26}{space 2} .1921434{col 37}{space 1}   -1.48{col 46}{space 3}0.139{col 54}{space 4}-.6616645{col 67}{space 3} .0927298
{txt}{space 8}658  {c |}{col 14}{res}{space 2} .3275314{col 26}{space 2} .1887989{col 37}{space 1}    1.73{col 46}{space 3}0.083{col 54}{space 4}-.0431002{col 67}{space 3}  .698163
{txt}{space 8}670  {c |}{col 14}{res}{space 2} .3825835{col 26}{space 2} .1558559{col 37}{space 1}    2.45{col 46}{space 3}0.014{col 54}{space 4} .0766223{col 67}{space 3} .6885447
{txt}{space 8}681  {c |}{col 14}{res}{space 2} .5596818{col 26}{space 2} .1672256{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .2314008{col 67}{space 3} .8879627
{txt}{space 8}707  {c |}{col 14}{res}{space 2} .1808984{col 26}{space 2} .1518311{col 37}{space 1}    1.19{col 46}{space 3}0.234{col 54}{space 4}-.1171617{col 67}{space 3} .4789585
{txt}{space 8}721  {c |}{col 14}{res}{space 2}-.1473622{col 26}{space 2} .3824245{col 37}{space 1}   -0.39{col 46}{space 3}0.700{col 54}{space 4}-.8981008{col 67}{space 3} .6033763
{txt}{space 8}729  {c |}{col 14}{res}{space 2}-.6785145{col 26}{space 2} .2184362{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-1.107327{col 67}{space 3}-.2497018
{txt}{space 8}748  {c |}{col 14}{res}{space 2} .3949832{col 26}{space 2} .1358392{col 37}{space 1}    2.91{col 46}{space 3}0.004{col 54}{space 4} .1283169{col 67}{space 3} .6616496
{txt}{space 8}763  {c |}{col 14}{res}{space 2} .1469789{col 26}{space 2} .2006121{col 37}{space 1}    0.73{col 46}{space 3}0.464{col 54}{space 4}-.2468432{col 67}{space 3}  .540801
{txt}{space 8}765  {c |}{col 14}{res}{space 2}-.3045579{col 26}{space 2} .1594589{col 37}{space 1}   -1.91{col 46}{space 3}0.057{col 54}{space 4}-.6175921{col 67}{space 3} .0084763
{txt}{space 8}768  {c |}{col 14}{res}{space 2} .2833616{col 26}{space 2} .1674414{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-.0453431{col 67}{space 3} .6120663
{txt}{space 8}813  {c |}{col 14}{res}{space 2}-.2310961{col 26}{space 2} .2803167{col 37}{space 1}   -0.82{col 46}{space 3}0.410{col 54}{space 4}-.7813866{col 67}{space 3} .3191943
{txt}{space 8}915  {c |}{col 14}{res}{space 2} .3030343{col 26}{space 2} .1693512{col 37}{space 1}    1.79{col 46}{space 3}0.074{col 54}{space 4}-.0294195{col 67}{space 3}  .635488
{txt}{space 8}922  {c |}{col 14}{res}{space 2} .3420623{col 26}{space 2}  .171563{col 37}{space 1}    1.99{col 46}{space 3}0.047{col 54}{space 4} .0052664{col 67}{space 3} .6788581
{txt}{space 8}944  {c |}{col 14}{res}{space 2}-.0367817{col 26}{space 2} .1825225{col 37}{space 1}   -0.20{col 46}{space 3}0.840{col 54}{space 4}-.3950921{col 67}{space 3} .3215288
{txt}{space 8}976  {c |}{col 14}{res}{space 2} .5606581{col 26}{space 2}  .158637{col 37}{space 1}    3.53{col 46}{space 3}0.000{col 54}{space 4} .2492373{col 67}{space 3} .8720789
{txt}{space 8}977  {c |}{col 14}{res}{space 2} .0750437{col 26}{space 2} .1370417{col 37}{space 1}    0.55{col 46}{space 3}0.584{col 54}{space 4}-.1939832{col 67}{space 3} .3440706
{txt}{space 8}986  {c |}{col 14}{res}{space 2} .2477574{col 26}{space 2} .1269673{col 37}{space 1}    1.95{col 46}{space 3}0.051{col 54}{space 4}-.0014924{col 67}{space 3} .4970073
{txt}{space 7}1007  {c |}{col 14}{res}{space 2}-.2818215{col 26}{space 2} .0998717{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-.4778799{col 67}{space 3}-.0857632
{txt}{space 7}1043  {c |}{col 14}{res}{space 2} .5318819{col 26}{space 2}  .144126{col 37}{space 1}    3.69{col 46}{space 3}0.000{col 54}{space 4} .2489477{col 67}{space 3} .8148161
{txt}{space 7}1055  {c |}{col 14}{res}{space 2} .6296224{col 26}{space 2} .1321011{col 37}{space 1}    4.77{col 46}{space 3}0.000{col 54}{space 4} .3702944{col 67}{space 3} .8889503
{txt}{space 7}1056  {c |}{col 14}{res}{space 2} .5079908{col 26}{space 2} .1603986{col 37}{space 1}    3.17{col 46}{space 3}0.002{col 54}{space 4} .1931119{col 67}{space 3} .8228697
{txt}{space 7}1089  {c |}{col 14}{res}{space 2} .3579146{col 26}{space 2} .1574537{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} .0488169{col 67}{space 3} .6670124
{txt}{space 7}1093  {c |}{col 14}{res}{space 2} .0680265{col 26}{space 2}  .354821{col 37}{space 1}    0.19{col 46}{space 3}0.848{col 54}{space 4}-.6285236{col 67}{space 3} .7645765
{txt}{space 7}1144  {c |}{col 14}{res}{space 2} .2329237{col 26}{space 2} .1506407{col 37}{space 1}    1.55{col 46}{space 3}0.122{col 54}{space 4}-.0627994{col 67}{space 3} .5286469
{txt}{space 7}1155  {c |}{col 14}{res}{space 2} .4976634{col 26}{space 2} .1642544{col 37}{space 1}    3.03{col 46}{space 3}0.003{col 54}{space 4} .1752151{col 67}{space 3} .8201117
{txt}{space 7}1192  {c |}{col 14}{res}{space 2} .2446456{col 26}{space 2} .2033143{col 37}{space 1}    1.20{col 46}{space 3}0.229{col 54}{space 4}-.1544813{col 67}{space 3} .6437725
{txt}{space 7}1244  {c |}{col 14}{res}{space 2} .0734922{col 26}{space 2} .1468541{col 37}{space 1}    0.50{col 46}{space 3}0.617{col 54}{space 4}-.2147974{col 67}{space 3} .3617818
{txt}{space 7}1281  {c |}{col 14}{res}{space 2} .2866551{col 26}{space 2} .1086216{col 37}{space 1}    2.64{col 46}{space 3}0.008{col 54}{space 4} .0734197{col 67}{space 3} .4998904
{txt}{space 7}1283  {c |}{col 14}{res}{space 2} .4440455{col 26}{space 2} .1269298{col 37}{space 1}    3.50{col 46}{space 3}0.000{col 54}{space 4} .1948692{col 67}{space 3} .6932218
{txt}{space 7}1324  {c |}{col 14}{res}{space 2} .0851038{col 26}{space 2} .1962054{col 37}{space 1}    0.43{col 46}{space 3}0.665{col 54}{space 4}-.3000675{col 67}{space 3} .4702751
{txt}{space 7}1348  {c |}{col 14}{res}{space 2}-.3425414{col 26}{space 2} .1919729{col 37}{space 1}   -1.78{col 46}{space 3}0.075{col 54}{space 4}-.7194039{col 67}{space 3} .0343212
{txt}{space 7}1386  {c |}{col 14}{res}{space 2} .1388188{col 26}{space 2} .1950117{col 37}{space 1}    0.71{col 46}{space 3}0.477{col 54}{space 4}-.2440092{col 67}{space 3} .5216468
{txt}{space 7}1406  {c |}{col 14}{res}{space 2} .0706163{col 26}{space 2} .1768389{col 37}{space 1}    0.40{col 46}{space 3}0.690{col 54}{space 4}-.2765365{col 67}{space 3} .4177692
{txt}{space 7}1439  {c |}{col 14}{res}{space 2} .8874009{col 26}{space 2} .1977595{col 37}{space 1}    4.49{col 46}{space 3}0.000{col 54}{space 4} .4991786{col 67}{space 3} 1.275623
{txt}{space 7}1471  {c |}{col 14}{res}{space 2} -.331768{col 26}{space 2}   .23965{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4}-.8022255{col 67}{space 3} .1386896
{txt}{space 7}1486  {c |}{col 14}{res}{space 2} .0255068{col 26}{space 2} .2238805{col 37}{space 1}    0.11{col 46}{space 3}0.909{col 54}{space 4}-.4139937{col 67}{space 3} .4650073
{txt}{space 7}1520  {c |}{col 14}{res}{space 2} .0292141{col 26}{space 2} .1773768{col 37}{space 1}    0.16{col 46}{space 3}0.869{col 54}{space 4}-.3189947{col 67}{space 3} .3774229
{txt}{space 7}1577  {c |}{col 14}{res}{space 2} .7545314{col 26}{space 2} .1361784{col 37}{space 1}    5.54{col 46}{space 3}0.000{col 54}{space 4} .4871992{col 67}{space 3} 1.021864
{txt}{space 7}1637  {c |}{col 14}{res}{space 2}-1.382148{col 26}{space 2} .2042975{col 37}{space 1}   -6.77{col 46}{space 3}0.000{col 54}{space 4}-1.783205{col 67}{space 3}-.9810906
{txt}{space 7}1669  {c |}{col 14}{res}{space 2} .1289736{col 26}{space 2} .1280565{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4}-.1224145{col 67}{space 3} .3803617
{txt}{space 7}1670  {c |}{col 14}{res}{space 2}-.0798182{col 26}{space 2} .1375321{col 37}{space 1}   -0.58{col 46}{space 3}0.562{col 54}{space 4}-.3498078{col 67}{space 3} .1901713
{txt}{space 7}1695  {c |}{col 14}{res}{space 2} .0502289{col 26}{space 2} .1639096{col 37}{space 1}    0.31{col 46}{space 3}0.759{col 54}{space 4}-.2715424{col 67}{space 3} .3720002
{txt}{space 7}1809  {c |}{col 14}{res}{space 2}-.5508625{col 26}{space 2} .1342546{col 37}{space 1}   -4.10{col 46}{space 3}0.000{col 54}{space 4} -.814418{col 67}{space 3}-.2873069
{txt}{space 7}1813  {c |}{col 14}{res}{space 2}  .269656{col 26}{space 2} .1385431{col 37}{space 1}    1.95{col 46}{space 3}0.052{col 54}{space 4}-.0023184{col 67}{space 3} .5416304
{txt}{space 7}1829  {c |}{col 14}{res}{space 2} .5569254{col 26}{space 2} .2194548{col 37}{space 1}    2.54{col 46}{space 3}0.011{col 54}{space 4} .1261131{col 67}{space 3} .9877378
{txt}{space 7}1844  {c |}{col 14}{res}{space 2} .1819605{col 26}{space 2} .1076591{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-.0293854{col 67}{space 3} .3933064
{txt}{space 7}1846  {c |}{col 14}{res}{space 2}-.9804669{col 26}{space 2} .2645703{col 37}{space 1}   -3.71{col 46}{space 3}0.000{col 54}{space 4}-1.499846{col 67}{space 3}-.4610882
{txt}{space 7}1864  {c |}{col 14}{res}{space 2} .3791187{col 26}{space 2} .2042825{col 37}{space 1}    1.86{col 46}{space 3}0.064{col 54}{space 4}-.0219088{col 67}{space 3} .7801461
{txt}{space 7}1865  {c |}{col 14}{res}{space 2} .3593892{col 26}{space 2} .1721019{col 37}{space 1}    2.09{col 46}{space 3}0.037{col 54}{space 4} .0215355{col 67}{space 3} .6972429
{txt}{space 7}1906  {c |}{col 14}{res}{space 2} .4478308{col 26}{space 2} .1677661{col 37}{space 1}    2.67{col 46}{space 3}0.008{col 54}{space 4} .1184886{col 67}{space 3} .7771729
{txt}{space 7}1919  {c |}{col 14}{res}{space 2}-.0221227{col 26}{space 2} .1657312{col 37}{space 1}   -0.13{col 46}{space 3}0.894{col 54}{space 4}-.3474701{col 67}{space 3} .3032248
{txt}{space 7}1945  {c |}{col 14}{res}{space 2} .0962137{col 26}{space 2} .1730367{col 37}{space 1}    0.56{col 46}{space 3}0.578{col 54}{space 4}-.2434752{col 67}{space 3} .4359025
{txt}{space 7}1960  {c |}{col 14}{res}{space 2}-.1241829{col 26}{space 2} .1641055{col 37}{space 1}   -0.76{col 46}{space 3}0.449{col 54}{space 4}-.4463389{col 67}{space 3} .1979732
{txt}{space 7}1969  {c |}{col 14}{res}{space 2} .5871177{col 26}{space 2} .1300988{col 37}{space 1}    4.51{col 46}{space 3}0.000{col 54}{space 4} .3317204{col 67}{space 3}  .842515
{txt}{space 7}1985  {c |}{col 14}{res}{space 2}-.0954589{col 26}{space 2}  .188255{col 37}{space 1}   -0.51{col 46}{space 3}0.612{col 54}{space 4}-.4650228{col 67}{space 3} .2741049
{txt}{space 7}2006  {c |}{col 14}{res}{space 2} .1677575{col 26}{space 2} .1897953{col 37}{space 1}    0.88{col 46}{space 3}0.377{col 54}{space 4}-.2048301{col 67}{space 3} .5403452
{txt}{space 7}2052  {c |}{col 14}{res}{space 2}-.0948042{col 26}{space 2} .1341474{col 37}{space 1}   -0.71{col 46}{space 3}0.480{col 54}{space 4}-.3581493{col 67}{space 3} .1685409
{txt}{space 7}2059  {c |}{col 14}{res}{space 2} .0214953{col 26}{space 2} .1165828{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-.2073688{col 67}{space 3} .2503593
{txt}{space 7}2070  {c |}{col 14}{res}{space 2}-.1707349{col 26}{space 2} .1904551{col 37}{space 1}   -0.90{col 46}{space 3}0.370{col 54}{space 4}-.5446179{col 67}{space 3}  .203148
{txt}{space 7}2073  {c |}{col 14}{res}{space 2} .1784849{col 26}{space 2} .2107926{col 37}{space 1}    0.85{col 46}{space 3}0.397{col 54}{space 4}-.2353226{col 67}{space 3} .5922924
{txt}{space 7}2124  {c |}{col 14}{res}{space 2} .1278391{col 26}{space 2} .1896154{col 37}{space 1}    0.67{col 46}{space 3}0.500{col 54}{space 4}-.2443954{col 67}{space 3} .5000737
{txt}{space 7}2129  {c |}{col 14}{res}{space 2}-1.361892{col 26}{space 2} .6192728{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-2.577588{col 67}{space 3}-.1461955
{txt}{space 7}2157  {c |}{col 14}{res}{space 2}  .240059{col 26}{space 2} .1567781{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4}-.0677126{col 67}{space 3} .5478306
{txt}{space 12} {c |}
{space 8}educ {c |}{col 14}{res}{space 2} .1377191{col 26}{space 2} .0107694{col 37}{space 1}   12.79{col 46}{space 3}0.000{col 54}{space 4} .1165778{col 67}{space 3} .1588605
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0417972{col 26}{space 2}  .003608{col 37}{space 1}   11.58{col 46}{space 3}0.000{col 54}{space 4} .0347143{col 67}{space 3} .0488801
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto Reduced_Fixed_Effects_Model
{txt}
{com}. est tab Reduced_Fixed_Effects_Model
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Reduced_~l} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 4}personid {c |}
{space 9}43  {c |}{res} {ralign 10:.25590128}{txt} {space 1}
{res}{txt}{space 9}73  {c |}{res} {ralign 10:-.06246857}{txt} {space 1}
{res}{txt}{space 9}78  {c |}{res} {ralign 10:.26186466}{txt} {space 1}
{res}{txt}{space 9}96  {c |}{res} {ralign 10:.40760788}{txt} {space 1}
{res}{txt}{space 8}116  {c |}{res} {ralign 10:.31131913}{txt} {space 1}
{res}{txt}{space 8}118  {c |}{res} {ralign 10:.78022847}{txt} {space 1}
{res}{txt}{space 8}156  {c |}{res} {ralign 10:-.02621563}{txt} {space 1}
{res}{txt}{space 8}188  {c |}{res} {ralign 10:-.35911875}{txt} {space 1}
{res}{txt}{space 8}193  {c |}{res} {ralign 10:.22862497}{txt} {space 1}
{res}{txt}{space 8}212  {c |}{res} {ralign 10:-.66319577}{txt} {space 1}
{res}{txt}{space 8}226  {c |}{res} {ralign 10:.44778215}{txt} {space 1}
{res}{txt}{space 8}247  {c |}{res} {ralign 10:-.48774446}{txt} {space 1}
{res}{txt}{space 8}248  {c |}{res} {ralign 10:.48693233}{txt} {space 1}
{res}{txt}{space 8}256  {c |}{res} {ralign 10:.88838455}{txt} {space 1}
{res}{txt}{space 8}259  {c |}{res} {ralign 10:.83744503}{txt} {space 1}
{res}{txt}{space 8}279  {c |}{res} {ralign 10:.2718268}{txt} {space 1}
{res}{txt}{space 8}284  {c |}{res} {ralign 10:.10650639}{txt} {space 1}
{res}{txt}{space 8}354  {c |}{res} {ralign 10:.02287669}{txt} {space 1}
{res}{txt}{space 8}370  {c |}{res} {ralign 10:.32879898}{txt} {space 1}
{res}{txt}{space 8}396  {c |}{res} {ralign 10:.45907589}{txt} {space 1}
{res}{txt}{space 8}410  {c |}{res} {ralign 10:-.11894904}{txt} {space 1}
{res}{txt}{space 8}412  {c |}{res} {ralign 10:.22338271}{txt} {space 1}
{res}{txt}{space 8}413  {c |}{res} {ralign 10:.48586043}{txt} {space 1}
{res}{txt}{space 8}417  {c |}{res} {ralign 10:.13147693}{txt} {space 1}
{res}{txt}{space 8}458  {c |}{res} {ralign 10:-.02378707}{txt} {space 1}
{res}{txt}{space 8}468  {c |}{res} {ralign 10:.39881278}{txt} {space 1}
{res}{txt}{space 8}479  {c |}{res} {ralign 10:.04025053}{txt} {space 1}
{res}{txt}{space 8}494  {c |}{res} {ralign 10:.59840662}{txt} {space 1}
{res}{txt}{space 8}505  {c |}{res} {ralign 10:.98942194}{txt} {space 1}
{res}{txt}{space 8}515  {c |}{res} {ralign 10:.07023915}{txt} {space 1}
{res}{txt}{space 8}528  {c |}{res} {ralign 10:-.32066435}{txt} {space 1}
{res}{txt}{space 8}533  {c |}{res} {ralign 10:.50939164}{txt} {space 1}
{res}{txt}{space 8}557  {c |}{res} {ralign 10:.73940557}{txt} {space 1}
{res}{txt}{space 8}568  {c |}{res} {ralign 10:-.13660412}{txt} {space 1}
{res}{txt}{space 8}609  {c |}{res} {ralign 10:.37139155}{txt} {space 1}
{res}{txt}{space 8}615  {c |}{res} {ralign 10:-.28446735}{txt} {space 1}
{res}{txt}{space 8}658  {c |}{res} {ralign 10:.32753142}{txt} {space 1}
{res}{txt}{space 8}670  {c |}{res} {ralign 10:.38258353}{txt} {space 1}
{res}{txt}{space 8}681  {c |}{res} {ralign 10:.55968175}{txt} {space 1}
{res}{txt}{space 8}707  {c |}{res} {ralign 10:.18089843}{txt} {space 1}
{res}{txt}{space 8}721  {c |}{res} {ralign 10:-.14736223}{txt} {space 1}
{res}{txt}{space 8}729  {c |}{res} {ralign 10:-.67851449}{txt} {space 1}
{res}{txt}{space 8}748  {c |}{res} {ralign 10:.39498325}{txt} {space 1}
{res}{txt}{space 8}763  {c |}{res} {ralign 10:.14697889}{txt} {space 1}
{res}{txt}{space 8}765  {c |}{res} {ralign 10:-.30455794}{txt} {space 1}
{res}{txt}{space 8}768  {c |}{res} {ralign 10:.28336161}{txt} {space 1}
{res}{txt}{space 8}813  {c |}{res} {ralign 10:-.23109615}{txt} {space 1}
{res}{txt}{space 8}915  {c |}{res} {ralign 10:.30303428}{txt} {space 1}
{res}{txt}{space 8}922  {c |}{res} {ralign 10:.34206225}{txt} {space 1}
{res}{txt}{space 8}944  {c |}{res} {ralign 10:-.03678167}{txt} {space 1}
{res}{txt}{space 8}976  {c |}{res} {ralign 10:.56065809}{txt} {space 1}
{res}{txt}{space 8}977  {c |}{res} {ralign 10:.07504369}{txt} {space 1}
{res}{txt}{space 8}986  {c |}{res} {ralign 10:.24775741}{txt} {space 1}
{res}{txt}{space 7}1007  {c |}{res} {ralign 10:-.2818215}{txt} {space 1}
{res}{txt}{space 7}1043  {c |}{res} {ralign 10:.53188195}{txt} {space 1}
{res}{txt}{space 7}1055  {c |}{res} {ralign 10:.62962237}{txt} {space 1}
{res}{txt}{space 7}1056  {c |}{res} {ralign 10:.50799079}{txt} {space 1}
{res}{txt}{space 7}1089  {c |}{res} {ralign 10:.35791463}{txt} {space 1}
{res}{txt}{space 7}1093  {c |}{res} {ralign 10:.06802648}{txt} {space 1}
{res}{txt}{space 7}1144  {c |}{res} {ralign 10:.23292374}{txt} {space 1}
{res}{txt}{space 7}1155  {c |}{res} {ralign 10:.49766339}{txt} {space 1}
{res}{txt}{space 7}1192  {c |}{res} {ralign 10:.2446456}{txt} {space 1}
{res}{txt}{space 7}1244  {c |}{res} {ralign 10:.07349219}{txt} {space 1}
{res}{txt}{space 7}1281  {c |}{res} {ralign 10:.28665506}{txt} {space 1}
{res}{txt}{space 7}1283  {c |}{res} {ralign 10:.44404548}{txt} {space 1}
{res}{txt}{space 7}1324  {c |}{res} {ralign 10:.08510383}{txt} {space 1}
{res}{txt}{space 7}1348  {c |}{res} {ralign 10:-.34254135}{txt} {space 1}
{res}{txt}{space 7}1386  {c |}{res} {ralign 10:.13881878}{txt} {space 1}
{res}{txt}{space 7}1406  {c |}{res} {ralign 10:.07061634}{txt} {space 1}
{res}{txt}{space 7}1439  {c |}{res} {ralign 10:.88740089}{txt} {space 1}
{res}{txt}{space 7}1471  {c |}{res} {ralign 10:-.33176797}{txt} {space 1}
{res}{txt}{space 7}1486  {c |}{res} {ralign 10:.02550678}{txt} {space 1}
{res}{txt}{space 7}1520  {c |}{res} {ralign 10:.02921411}{txt} {space 1}
{res}{txt}{space 7}1577  {c |}{res} {ralign 10:.75453144}{txt} {space 1}
{res}{txt}{space 7}1637  {c |}{res} {ralign 10:-1.3821476}{txt} {space 1}
{res}{txt}{space 7}1669  {c |}{res} {ralign 10:.12897358}{txt} {space 1}
{res}{txt}{space 7}1670  {c |}{res} {ralign 10:-.07981825}{txt} {space 1}
{res}{txt}{space 7}1695  {c |}{res} {ralign 10:.05022893}{txt} {space 1}
{res}{txt}{space 7}1809  {c |}{res} {ralign 10:-.55086246}{txt} {space 1}
{res}{txt}{space 7}1813  {c |}{res} {ralign 10:.269656}{txt} {space 1}
{res}{txt}{space 7}1829  {c |}{res} {ralign 10:.55692543}{txt} {space 1}
{res}{txt}{space 7}1844  {c |}{res} {ralign 10:.18196051}{txt} {space 1}
{res}{txt}{space 7}1846  {c |}{res} {ralign 10:-.98046691}{txt} {space 1}
{res}{txt}{space 7}1864  {c |}{res} {ralign 10:.37911867}{txt} {space 1}
{res}{txt}{space 7}1865  {c |}{res} {ralign 10:.3593892}{txt} {space 1}
{res}{txt}{space 7}1906  {c |}{res} {ralign 10:.44783078}{txt} {space 1}
{res}{txt}{space 7}1919  {c |}{res} {ralign 10:-.02212266}{txt} {space 1}
{res}{txt}{space 7}1945  {c |}{res} {ralign 10:.09621367}{txt} {space 1}
{res}{txt}{space 7}1960  {c |}{res} {ralign 10:-.12418287}{txt} {space 1}
{res}{txt}{space 7}1969  {c |}{res} {ralign 10:.5871177}{txt} {space 1}
{res}{txt}{space 7}1985  {c |}{res} {ralign 10:-.09545891}{txt} {space 1}
{res}{txt}{space 7}2006  {c |}{res} {ralign 10:.16775754}{txt} {space 1}
{res}{txt}{space 7}2052  {c |}{res} {ralign 10:-.09480419}{txt} {space 1}
{res}{txt}{space 7}2059  {c |}{res} {ralign 10:.02149525}{txt} {space 1}
{res}{txt}{space 7}2070  {c |}{res} {ralign 10:-.17073491}{txt} {space 1}
{res}{txt}{space 7}2073  {c |}{res} {ralign 10:.17848489}{txt} {space 1}
{res}{txt}{space 7}2124  {c |}{res} {ralign 10:.12783912}{txt} {space 1}
{res}{txt}{space 7}2129  {c |}{res} {ralign 10:-1.3618916}{txt} {space 1}
{res}{txt}{space 7}2157  {c |}{res} {ralign 10:.240059}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 8}educ {c |}{res} {ralign 10:.13771912}{txt} {space 1}
{res}{txt}{space 4}potexper {c |}{res} {ralign 10:.04179719}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. 
. * Saving the Fixed Effect Coefficients
. matrix coef = e(b)
{txt}
{com}. matrix coef = coef'
{txt}
{com}. matrix coef = coef[1..100, 1]
{txt}
{com}. 
. ** Question 2
. 
. * Obtaining One Time-Invariant Variable for Each PersonID
. bysort personid: keep if _n == 1
{txt}(758 observations deleted)

{com}. svmat double coef, names(coefficients)
{txt}
{com}. drop if coefficients == 0
{txt}(1 observation deleted)

{com}. 
. * Running Regression on Invariant Variables
. reg coefficients ability mothered fathered brknhome siblings

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        99
{txt}{hline 13}{c +}{hline 34}   F(5, 93)        = {res}     1.15
{txt}       Model {c |} {res}  .99004822         5  .198009644   {txt}Prob > F        ={res}    0.3418
{txt}    Residual {c |} {res} 16.0668315        93  .172761629   {txt}R-squared       ={res}    0.0580
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0074
{txt}       Total {c |} {res} 17.0568798        98  .174049793   {txt}Root MSE        =   {res} .41565

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}coefficien~1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}ability {c |}{col 14}{res}{space 2} .1065495{col 26}{space 2} .0471801{col 37}{space 1}    2.26{col 46}{space 3}0.026{col 54}{space 4} .0128591{col 67}{space 3} .2002399
{txt}{space 4}mothered {c |}{col 14}{res}{space 2}-.0119641{col 26}{space 2} .0221619{col 37}{space 1}   -0.54{col 46}{space 3}0.591{col 54}{space 4}-.0559733{col 67}{space 3} .0320451
{txt}{space 4}fathered {c |}{col 14}{res}{space 2}-.0030797{col 26}{space 2} .0172447{col 37}{space 1}   -0.18{col 46}{space 3}0.859{col 54}{space 4}-.0373243{col 67}{space 3} .0311649
{txt}{space 4}brknhome {c |}{col 14}{res}{space 2} .1536236{col 26}{space 2}  .143518{col 37}{space 1}    1.07{col 46}{space 3}0.287{col 54}{space 4}-.1313747{col 67}{space 3}  .438622
{txt}{space 4}siblings {c |}{col 14}{res}{space 2} .0003818{col 26}{space 2} .0198849{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4}-.0391058{col 67}{space 3} .0398693
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .3030937{col 26}{space 2} .2347034{col 37}{space 1}    1.29{col 46}{space 3}0.200{col 54}{space 4}-.1629807{col 67}{space 3} .7691681
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto Individual_Fmodel
{txt}
{com}. * Running Saved Results to Generate Tables
. 
. ** HW 2
. est tab linear_coef bootstrap_49 bootstrap_499, se 
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:linear_c~f} {space 1} {center 10:bootstr~49} {space 1} {center 10:bootst~499} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:1.1997465}{txt} {space 1}{res} {ralign 10:1.1997465}{txt} {space 1}{res} {ralign 10:1.1997465}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.01762875}{txt} {space 1}{res} {ralign 10:.0177973}{txt} {space 1}{res} {ralign 10:.01774212}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.90108742}{txt} {space 1}{res} {ralign 10:-.90108742}{txt} {space 1}{res} {ralign 10:-.90108742}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.0028667}{txt} {space 1}{res} {ralign 10:.00286273}{txt} {space 1}{res} {ralign 10:.00295972}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.11044271}{txt} {space 1}{res} {ralign 10:.11044271}{txt} {space 1}{res} {ralign 10:.11044271}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.02187674}{txt} {space 1}{res} {ralign 10:.02117776}{txt} {space 1}{res} {ralign 10:.02322948}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.5025849}{txt} {space 1}{res} {ralign 10:2.5025849}{txt} {space 1}{res} {ralign 10:2.5025849}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.04126457}{txt} {space 1}{res} {ralign 10:.04301443}{txt} {space 1}{res} {ralign 10:.04248579}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 53:legend: b/se}
{res}{txt}
{com}. est tab Probit_model Probit_model2 Logit_model Linear_model
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Probit_m~l} {space 1} {center 10:Probit_m~2} {space 1} {center 10:Logit_mo~l} {space 1} {center 10:Linear_m~l} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}ydum         {txt}{c |}{res}
{txt}{space 10}X1 {c |}{res} {ralign 10:1.2083039}{txt} {space 1}{res} {ralign 10:1.2083039}{txt} {space 1}{res} {ralign 10:2.1855843}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.88259698}{txt} {space 1}{res} {ralign 10:-.88259698}{txt} {space 1}{res} {ralign 10:-1.5937661}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.15958595}{txt} {space 1}{res} {ralign 10:.15958595}{txt} {space 1}{res} {ralign 10:.2781579}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.8871615}{txt} {space 1}{res} {ralign 10:2.8871615}{txt} {space 1}{res} {ralign 10:5.2063742}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}_            {txt}{c |}{res}
{txt}{space 10}X1 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.14642416}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.10226858}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.02595657}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.88105424}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. est tab Marginal_Probit Marginal_Delta_Probit Marginal_Logit /*
> */ Marginal_Delta_Logit, se
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Marginal~t} {space 1} {center 10:Marginal~t} {space 1} {center 10:Marginal~t} {space 1} {center 10:Marginal~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:1.2083039}{txt} {space 1}{res} {ralign 10:1.2083039}{txt} {space 1}{res} {ralign 10:2.1855843}{txt} {space 1}{res} {ralign 10:2.1855843}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.04397785}{txt} {space 1}{res} {ralign 10:.04397785}{txt} {space 1}{res} {ralign 10:.08250679}{txt} {space 1}{res} {ralign 10:.08250679}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.88259698}{txt} {space 1}{res} {ralign 10:-.88259698}{txt} {space 1}{res} {ralign 10:-1.5937661}{txt} {space 1}{res} {ralign 10:-1.5937661}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.01813833}{txt} {space 1}{res} {ralign 10:.01813833}{txt} {space 1}{res} {ralign 10:.03649839}{txt} {space 1}{res} {ralign 10:.03649839}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.15958595}{txt} {space 1}{res} {ralign 10:.15958595}{txt} {space 1}{res} {ralign 10:.2781579}{txt} {space 1}{res} {ralign 10:.2781579}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.04764965}{txt} {space 1}{res} {ralign 10:.04764965}{txt} {space 1}{res} {ralign 10:.08573192}{txt} {space 1}{res} {ralign 10:.08573192}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.8871615}{txt} {space 1}{res} {ralign 10:2.8871615}{txt} {space 1}{res} {ralign 10:5.2063742}{txt} {space 1}{res} {ralign 10:5.2063742}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.09879706}{txt} {space 1}{res} {ralign 10:.09879706}{txt} {space 1}{res} {ralign 10:.18592874}{txt} {space 1}{res} {ralign 10:.18592874}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 66:legend: b/se}
{res}{txt}
{com}. 
. ** HW 3
. est tab conditional_logit multinomial_logit mixed_logit, se
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:conditio~t} {space 1} {center 10:multinom~t} {space 1} {center 10:mixed_lo~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}Brand        {txt}{c |}{res}
{txt}{space 7}Price {c |}{res} {ralign 10:-6.6565793}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-6.6596692}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17427926}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.17476978}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}2            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.00308874}{txt} {space 1}{res} {ralign 10:-.00425993}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00311397}{txt} {space 1}{res} {ralign 10:.00343921}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-.95430683}{txt} {space 1}{res} {ralign 10:-.84532415}{txt} {space 1}{res} {ralign 10:-.84067337}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.05004624}{txt} {space 1}{res} {ralign 10:.09313545}{txt} {space 1}{res} {ralign 10:.10384458}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}3            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01458623}{txt} {space 1}{res} {ralign 10:.01434397}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00382546}{txt} {space 1}{res} {ralign 10:.00392209}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.2969683}{txt} {space 1}{res} {ralign 10:-2.3998576}{txt} {space 1}{res} {ralign 10:.88860693}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10865147}{txt} {space 1}{res} {ralign 10:.13358016}{txt} {space 1}{res} {ralign 10:.15945855}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}4            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00405043}{txt} {space 1}{res} {ralign 10:.00409985}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00309258}{txt} {space 1}{res} {ralign 10:.00320421}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.7173324}{txt} {space 1}{res} {ralign 10:-1.2013265}{txt} {space 1}{res} {ralign 10:-1.8284916}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.05415816}{txt} {space 1}{res} {ralign 10:.0971021}{txt} {space 1}{res} {ralign 10:.10321797}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}5            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.00125359}{txt} {space 1}{res} {ralign 10:-.00118286}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00420238}{txt} {space 1}{res} {ralign 10:.00429708}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-2.9040048}{txt} {space 1}{res} {ralign 10:-1.6905817}{txt} {space 1}{res} {ralign 10:-2.8734104}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.07146052}{txt} {space 1}{res} {ralign 10:.12699518}{txt} {space 1}{res} {ralign 10:.13475726}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}6            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.03061202}{txt} {space 1}{res} {ralign 10:.02980895}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00467399}{txt} {space 1}{res} {ralign 10:.00472672}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.5153112}{txt} {space 1}{res} {ralign 10:-4.1397672}{txt} {space 1}{res} {ralign 10:-2.4571185}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12623034}{txt} {space 1}{res} {ralign 10:.21098899}{txt} {space 1}{res} {ralign 10:.21542599}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}7            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.00693258}{txt} {space 1}{res} {ralign 10:-.00924559}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.0044161}{txt} {space 1}{res} {ralign 10:.00459348}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.25176838}{txt} {space 1}{res} {ralign 10:-1.5310415}{txt} {space 1}{res} {ralign 10:.49686917}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.07916402}{txt} {space 1}{res} {ralign 10:.12804344}{txt} {space 1}{res} {ralign 10:.14248236}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}8            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.02288616}{txt} {space 1}{res} {ralign 10:.02199646}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00362167}{txt} {space 1}{res} {ralign 10:.00382029}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.4648684}{txt} {space 1}{res} {ralign 10:-2.8483523}{txt} {space 1}{res} {ralign 10:.80306}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1180467}{txt} {space 1}{res} {ralign 10:.13938482}{txt} {space 1}{res} {ralign 10:.17091994}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}9            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01774297}{txt} {space 1}{res} {ralign 10:.01699109}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.0037623}{txt} {space 1}{res} {ralign 10:.0039155}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.3575051}{txt} {space 1}{res} {ralign 10:-2.5755973}{txt} {space 1}{res} {ralign 10:1.8641255}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13377396}{txt} {space 1}{res} {ralign 10:.13614002}{txt} {space 1}{res} {ralign 10:.1799469}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}10           {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01079092}{txt} {space 1}{res} {ralign 10:.00875958}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01013005}{txt} {space 1}{res} {ralign 10:.01030074}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-3.8965935}{txt} {space 1}{res} {ralign 10:-4.2822699}{txt} {space 1}{res} {ralign 10:-4.1423856}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17741899}{txt} {space 1}{res} {ralign 10:.34579197}{txt} {space 1}{res} {ralign 10:.35065634}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 53:legend: b/se}
{res}{txt}
{com}. 
. ** HW 4
. est tab RE_model BE_model Within_model Difference_model, se
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:RE_model} {space 1} {center 10:BE_model} {space 1} {center 10:Within_m~l} {space 1} {center 10:Differen~l} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 8}educ {c |}{res} {ralign 10:.10793802}{txt} {space 1}{res} {ralign 10:.09309987}{txt} {space 1}{res} {ralign 10:.12366202}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00338321}{txt} {space 1}{res} {ralign 10:.00466849}{txt} {space 1}{res} {ralign 10:.00576187}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 4}potexper {c |}{res} {ralign 10:.03876449}{txt} {space 1}{res} {ralign 10:.02599874}{txt} {space 1}{res} {ralign 10:.03856107}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00071784}{txt} {space 1}{res} {ralign 10:.00360489}{txt} {space 1}{res} {ralign 10:.00075848}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 3}educ_diff {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.04310838}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01517918}{txt} {space 1}
{res}{txt}potexper_d~f {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.05353695}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00292212}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.56352057}{txt} {space 1}{res} {ralign 10:.84556882}{txt} {space 1}{res} {ralign 10:.40680158}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.0438846}{txt} {space 1}{res} {ralign 10:.07701791}{txt} {space 1}{res} {ralign 10:.0717348}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 66:legend: b/se}
{res}{txt}
{com}. est tab Reduced_Fixed_Effects_Model Individual_Fmodel, se
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:Reduced_~l} {space 1} {center 10:Individu~l} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 4}personid {c |}
{space 9}43  {c |}{res} {ralign 10:.25590128}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21394426}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 9}73  {c |}{res} {ralign 10:-.06246857}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17403523}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 9}78  {c |}{res} {ralign 10:.26186466}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.2535708}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 9}96  {c |}{res} {ralign 10:.40760788}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1380487}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}116  {c |}{res} {ralign 10:.31131913}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18726066}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}118  {c |}{res} {ralign 10:.78022847}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10469269}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}156  {c |}{res} {ralign 10:-.02621563}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14859769}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}188  {c |}{res} {ralign 10:-.35911875}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19371}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}193  {c |}{res} {ralign 10:.22862497}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16596898}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}212  {c |}{res} {ralign 10:-.66319577}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18900941}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}226  {c |}{res} {ralign 10:.44778215}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14412742}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}247  {c |}{res} {ralign 10:-.48774446}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1949071}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}248  {c |}{res} {ralign 10:.48693233}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15987865}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}256  {c |}{res} {ralign 10:.88838455}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12631499}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}259  {c |}{res} {ralign 10:.83744503}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17924184}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}279  {c |}{res} {ralign 10:.2718268}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14909934}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}284  {c |}{res} {ralign 10:.10650639}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15719347}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}354  {c |}{res} {ralign 10:.02287669}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10753556}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}370  {c |}{res} {ralign 10:.32879898}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.20365027}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}396  {c |}{res} {ralign 10:.45907589}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.25043726}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}410  {c |}{res} {ralign 10:-.11894904}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14508436}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}412  {c |}{res} {ralign 10:.22338271}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13673104}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}413  {c |}{res} {ralign 10:.48586043}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14643018}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}417  {c |}{res} {ralign 10:.13147693}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17107541}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}458  {c |}{res} {ralign 10:-.02378707}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15828334}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}468  {c |}{res} {ralign 10:.39881278}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18478408}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}479  {c |}{res} {ralign 10:.04025053}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15051429}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}494  {c |}{res} {ralign 10:.59840662}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17106739}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}505  {c |}{res} {ralign 10:.98942194}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13812781}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}515  {c |}{res} {ralign 10:.07023915}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21071133}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}528  {c |}{res} {ralign 10:-.32066435}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13560463}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}533  {c |}{res} {ralign 10:.50939164}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18080838}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}557  {c |}{res} {ralign 10:.73940557}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15503461}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}568  {c |}{res} {ralign 10:-.13660412}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.22338431}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}609  {c |}{res} {ralign 10:.37139155}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.258863}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}615  {c |}{res} {ralign 10:-.28446735}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19214337}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}658  {c |}{res} {ralign 10:.32753142}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18879888}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}670  {c |}{res} {ralign 10:.38258353}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15585593}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}681  {c |}{res} {ralign 10:.55968175}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16722557}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}707  {c |}{res} {ralign 10:.18089843}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15183113}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}721  {c |}{res} {ralign 10:-.14736223}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.38242447}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}729  {c |}{res} {ralign 10:-.67851449}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21843618}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}748  {c |}{res} {ralign 10:.39498325}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13583925}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}763  {c |}{res} {ralign 10:.14697889}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.20061209}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}765  {c |}{res} {ralign 10:-.30455794}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1594589}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}768  {c |}{res} {ralign 10:.28336161}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16744144}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}813  {c |}{res} {ralign 10:-.23109615}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.28031667}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}915  {c |}{res} {ralign 10:.30303428}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16935117}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}922  {c |}{res} {ralign 10:.34206225}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17156304}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}944  {c |}{res} {ralign 10:-.03678167}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18252251}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}976  {c |}{res} {ralign 10:.56065809}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15863704}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}977  {c |}{res} {ralign 10:.07504369}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13704168}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}986  {c |}{res} {ralign 10:.24775741}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1269673}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1007  {c |}{res} {ralign 10:-.2818215}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.09987167}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1043  {c |}{res} {ralign 10:.53188195}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14412603}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1055  {c |}{res} {ralign 10:.62962237}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13210107}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1056  {c |}{res} {ralign 10:.50799079}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16039859}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1089  {c |}{res} {ralign 10:.35791463}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15745367}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1093  {c |}{res} {ralign 10:.06802648}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.35482099}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1144  {c |}{res} {ralign 10:.23292374}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15064069}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1155  {c |}{res} {ralign 10:.49766339}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1642544}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1192  {c |}{res} {ralign 10:.2446456}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.20331433}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1244  {c |}{res} {ralign 10:.07349219}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14685405}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1281  {c |}{res} {ralign 10:.28665506}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1086216}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1283  {c |}{res} {ralign 10:.44404548}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12692984}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1324  {c |}{res} {ralign 10:.08510383}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19620537}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1348  {c |}{res} {ralign 10:-.34254135}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19197291}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1386  {c |}{res} {ralign 10:.13881878}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1950117}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1406  {c |}{res} {ralign 10:.07061634}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17683886}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1439  {c |}{res} {ralign 10:.88740089}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19775953}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1471  {c |}{res} {ralign 10:-.33176797}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.23965}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1486  {c |}{res} {ralign 10:.02550678}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.22388054}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1520  {c |}{res} {ralign 10:.02921411}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17737677}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1577  {c |}{res} {ralign 10:.75453144}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13617844}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1637  {c |}{res} {ralign 10:-1.3821476}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.20429753}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1669  {c |}{res} {ralign 10:.12897358}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12805653}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1670  {c |}{res} {ralign 10:-.07981825}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13753205}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1695  {c |}{res} {ralign 10:.05022893}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16390955}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1809  {c |}{res} {ralign 10:-.55086246}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13425461}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1813  {c |}{res} {ralign 10:.269656}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13854311}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1829  {c |}{res} {ralign 10:.55692543}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.2194548}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1844  {c |}{res} {ralign 10:.18196051}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10765912}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1846  {c |}{res} {ralign 10:-.98046691}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.2645703}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1864  {c |}{res} {ralign 10:.37911867}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.20428247}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1865  {c |}{res} {ralign 10:.3593892}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17210192}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1906  {c |}{res} {ralign 10:.44783078}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16776614}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1919  {c |}{res} {ralign 10:-.02212266}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16573125}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1945  {c |}{res} {ralign 10:.09621367}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17303672}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1960  {c |}{res} {ralign 10:-.12418287}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16410554}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1969  {c |}{res} {ralign 10:.5871177}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13009882}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1985  {c |}{res} {ralign 10:-.09545891}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18825497}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2006  {c |}{res} {ralign 10:.16775754}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18979531}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2052  {c |}{res} {ralign 10:-.09480419}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13414738}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2059  {c |}{res} {ralign 10:.02149525}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1165828}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2070  {c |}{res} {ralign 10:-.17073491}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19045511}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2073  {c |}{res} {ralign 10:.17848489}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21079258}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2124  {c |}{res} {ralign 10:.12783912}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18961542}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2129  {c |}{res} {ralign 10:-1.3618916}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.61927281}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2157  {c |}{res} {ralign 10:.240059}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15677812}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 8}educ {c |}{res} {ralign 10:.13771912}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.01076937}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 4}potexper {c |}{res} {ralign 10:.04179719}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00360802}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 5}ability {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.10654954}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.04718014}{txt} {space 1}
{res}{txt}{space 4}mothered {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.01196407}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.02216193}{txt} {space 1}
{res}{txt}{space 4}fathered {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.00307969}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01724472}{txt} {space 1}
{res}{txt}{space 4}brknhome {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.15362363}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.14351801}{txt} {space 1}
{res}{txt}{space 4}siblings {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00038175}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01988493}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.30309371}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.23470337}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 40:legend: b/se}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. 